{
  "manuscript_v2": "# Rollup Stages: Current Landscape, Challenges, and the Path to Full Decentralization\n\n## A Comprehensive Research Report on Layer 2 Scaling Solutions\n\n---\n\n## Executive Summary\n\nRollups have emerged as the dominant paradigm for scaling Ethereum and other Layer 1 blockchains, processing billions of dollars in transactions while inheriting the security guarantees of their underlying networks. However, the journey from centralized sequencers to fully decentralized, trustless systems remains incomplete. This report provides a comprehensive analysis of the rollup maturity framework, examining the current state of major rollup implementations, identifying critical bottlenecks preventing progression to higher stages, and evaluating emerging solutions.\n\nOur analysis reveals that as of early 2025, the vast majority of rollups by Total Value Locked (TVL) remain at Stage 0, with Arbitrum One representing the most advanced major rollup at Stage 1. Stage 2—the highest level of decentralization where users can exit without any trust assumptions beyond L1 security and cryptographic soundness—remains unachieved by any major rollup. Key bottlenecks include incomplete proof system maturity, centralized sequencer architectures, Security Council governance structures with broad upgrade powers, and the absence of robust cross-rollup interoperability with appropriate trust guarantees.\n\nThis report examines these challenges through technical, economic, and governance lenses, providing actionable insights for researchers, developers, and stakeholders invested in the rollup ecosystem's maturation. We conclude that while the technical foundations for Stage 2 rollups exist, achieving this milestone requires coordinated advances in proof systems, decentralized sequencing, governance minimization, and cross-rollup bridging infrastructure over the next 24-48 months.\n\n---\n\n## 1. Introduction\n\n### 1.1 The Scaling Imperative\n\nEthereum's transition to proof-of-stake and the implementation of EIP-4844 (Proto-Danksharding) have established a clear roadmap: the base layer optimizes for security and data availability, while execution scales through Layer 2 solutions. This \"rollup-centric\" roadmap, articulated by Vitalik Buterin in 2020, has fundamentally shaped blockchain architecture.\n\nRollups execute transactions off-chain while posting transaction data (or state differences) to the parent chain, achieving throughput improvements of 10-100x while maintaining security guarantees derived from the underlying Layer 1. As of January 2025, rollups collectively secure over $40 billion in TVL and process more daily transactions than Ethereum mainnet.\n\n### 1.2 The Trust Spectrum\n\nDespite their promise, rollups exist on a spectrum of decentralization and trustlessness. Early implementations required users to trust operators completely—a regression from blockchain's core value proposition. The community recognized this tension, leading to the development of maturity frameworks that track rollups' progression toward full decentralization.\n\n### 1.3 Research Objectives\n\nThis report addresses four primary questions:\n\n1. What constitutes a mature, trustless rollup, and how do we measure progress toward this goal?\n2. What is the current state of major rollup implementations relative to these standards?\n3. What technical, economic, and governance bottlenecks prevent advancement, and what solutions are emerging?\n4. How do cross-rollup interoperability and bridging mechanisms affect the practical security of the rollup ecosystem?\n\n---\n\n## 2. The Rollup Stage Framework\n\n### 2.1 Origins and Rationale\n\nThe rollup stage framework was formalized by L2Beat, the leading Layer 2 analytics platform, in collaboration with the Ethereum research community. The framework emerged from recognition that marketing claims about \"decentralization\" and \"security\" required objective, verifiable criteria.\n\nThe framework defines three stages (0, 1, and 2), each representing increasing levels of trustlessness and decentralization. Critically, the framework focuses on **exit guarantees**—the ability of users to withdraw their funds without relying on any trusted party.\n\n### 2.2 Stage Definitions\n\n#### Stage 0: Full Training Wheels\n\nAt Stage 0, a rollup has deployed on mainnet but retains significant centralized control. The defining characteristics include:\n\n- **Centralized sequencing**: A single operator orders and executes transactions\n- **Upgradeable contracts**: The rollup's smart contracts can be modified without delay or with minimal timelock\n- **No fraud/validity proofs**: Users cannot independently verify state transitions, or proofs exist but can be overridden\n- **Operator-dependent exits**: Users rely on the operator to process withdrawals\n\nStage 0 rollups are functionally similar to sidechains with additional data availability guarantees. Users must trust that operators will not censor transactions, steal funds through malicious upgrades, or abandon the network.\n\n#### Stage 1: Limited Training Wheels\n\nStage 1 represents meaningful progress toward trustlessness:\n\n- **Functional proof system**: Either fraud proofs (optimistic rollups) or validity proofs (ZK-rollups) are deployed and operational\n- **Permissionless verification**: Anyone can submit fraud proofs or verify validity proofs\n- **Escape hatch mechanism**: Users can force withdrawals through the L1 if the operator becomes unresponsive\n- **Security Council**: A multisig can intervene in case of bugs, but with significant constraints (typically requiring supermajority threshold)\n\nThe key advancement at Stage 1 is that **users can exit without operator cooperation**, though they may still need to trust a Security Council for bug fixes during an interim period.\n\n#### Stage 2: No Training Wheels\n\nStage 2 represents full trustlessness:\n\n- **Immutable or governance-minimized contracts**: Upgrades require extended timelocks (30+ days) or are impossible\n- **No Security Council override**: Or the council can only act after the timelock expires, giving users time to exit\n- **Battle-tested proof system**: The proof mechanism has been operational without critical failures for an extended period\n- **Decentralized sequencing**: Multiple parties can propose blocks, eliminating single points of failure (or users can self-sequence via L1)\n\nAt Stage 2, the rollup inherits Ethereum's security guarantees fully. Users need only trust the L1 consensus and the mathematical soundness of the proof system.\n\n### 2.3 Framework Limitations and Ongoing Debates\n\nThe stage framework, while valuable, has acknowledged limitations:\n\n1. **Binary categorization**: Rollups may meet some but not all criteria for a stage, creating edge cases where classification is contested\n2. **Implementation nuance**: Two Stage 1 rollups may have significantly different security properties depending on Security Council structure, proof system maturity, and escape hatch robustness\n3. **Dynamic assessment**: A rollup's stage can regress if vulnerabilities are discovered or if governance decisions weaken security guarantees\n4. **Scope limitations**: The framework doesn't directly assess liveness, MEV extraction, economic security, or cross-rollup bridging trust assumptions\n5. **Classification disputes**: Stage classifications are sometimes contested by rollup teams or community members who interpret criteria differently; readers should consult L2Beat directly for current classifications and understand the methodology behind disputed assessments\n\n---\n\n## 3. Current Landscape Analysis\n\n### 3.1 Market Overview\n\nAs of January 2025, the rollup ecosystem comprises over 50 active networks with combined TVL exceeding $40 billion. The market is dominated by a small number of major players:\n\n| Rollup | Type | TVL (USD) | Stage | Launch Date |\n|--------|------|-----------|-------|-------------|\n| Arbitrum One | Optimistic | ~$15B | 1 | August 2021 |\n| Base | Optimistic | ~$12B | 0 | August 2023 |\n| OP Mainnet | Optimistic | ~$7B | 0 | December 2021 |\n| zkSync Era | ZK | ~$1B | 0 | March 2023 |\n| Starknet | ZK | ~$500M | 0 | November 2022 |\n| Linea | ZK | ~$800M | 0 | July 2023 |\n| Scroll | ZK | ~$600M | 0 | October 2023 |\n\n*Data approximate as of January 2025. Stage classifications per L2Beat methodology and subject to change. Readers should verify current status at l2beat.com.*\n\n### 3.2 Optimistic Rollups: Detailed Assessment\n\n#### 3.2.1 Arbitrum One\n\nArbitrum One, developed by Offchain Labs, represents the most mature optimistic rollup implementation. Key characteristics:\n\n**Stage 1 Qualifications:**\n- Deployed BOLD (Bounded Liquidity Delay) fraud proof system in late 2024\n- Permissionless validation enabled—anyone can challenge invalid state roots\n- Functional escape hatch through `forceInclusion` mechanism allowing users to submit transactions directly to L1\n- 6 day, 8 hour challenge period for fraud proofs\n\n**Remaining Limitations:**\n- Security Council (12-member multisig) can upgrade contracts with a 3-day delay for non-emergency actions\n- Emergency upgrades require 9/12 threshold but can bypass timelock\n- Sequencer remains centralized (operated by Offchain Labs)\n- Council can pause the system in emergencies\n\nThe Security Council's powers represent the primary barrier to Stage 2. While the council provides important bug-fix capabilities, its ability to execute emergency upgrades creates trust assumptions that Stage 2 would eliminate.\n\n#### 3.2.2 Optimism (OP Mainnet)\n\nOP Mainnet, the flagship chain of the OP Stack, has made significant progress but remains at Stage 0:\n\n**Current State:**\n- Fault proof system (FPAC - Fault Proof Alpha Cannon) launched in June 2024\n- Permissionless proposers enabled\n- 7-day challenge window\n\n**Stage 0 Classification Rationale:**\n- Guardian role can disable fault proofs entirely, reverting to permissioned output proposals\n- Deputy Guardian can pause withdrawals\n- Security Council can upgrade without delay in emergency situations\n- Proof system relatively new, requiring more battle-testing before governance constraints can be safely reduced\n\nThe OP Stack's modular design means improvements benefit the entire Superchain ecosystem (Base, Mode, Zora, etc.), but this also means vulnerabilities affect multiple networks simultaneously—a systemic risk consideration.\n\n#### 3.2.3 Base\n\nBase, developed by Coinbase, is the largest Stage 0 rollup by TVL:\n\n**Current Limitations:**\n- Inherits OP Stack limitations including Guardian override capabilities\n- Additional Coinbase operational dependencies\n- Relies on Optimism's Security Council rather than independent governance\n- Sequencer operated by Coinbase with no current decentralization timeline\n\nBase's rapid growth ($12B+ TVL) despite Stage 0 status highlights that users currently prioritize other factors (UX, ecosystem, institutional backing, regulatory clarity) over decentralization metrics—a finding with implications for the pace of ecosystem-wide decentralization.\n\n### 3.3 ZK-Rollups: Detailed Assessment\n\n#### 3.3.1 zkSync Era\n\nzkSync Era, developed by Matter Labs, is the largest ZK-rollup by TVL:\n\n**Technical Architecture:**\n- Uses a customized PLONK-based proof system (specifically a variant with custom gates and lookup arguments)\n- Boojum prover utilizing FRI-based polynomial commitments for improved efficiency\n- EVM-equivalent execution environment via zkEVM\n\n**Stage 0 Limitations:**\n- Validity proofs cover state transitions but the system retains centralized override capabilities\n- Centralized sequencer and prover operated by Matter Labs\n- Upgradeable contracts with Security Council control\n- Escape hatch mechanism exists but has not been battle-tested in adversarial conditions\n\n#### 3.3.2 Starknet\n\nStarknet, developed by StarkWare, uses STARK proofs:\n\n**Technical Characteristics:**\n- Cairo VM (not EVM-equivalent, requiring contract rewriting or transpilation)\n- Recursive proofs for scalability via SHARP (Shared Prover)\n- FRI-based polynomial commitments providing post-quantum security assumptions\n\n**Current Limitations:**\n- Centralized sequencer operated by StarkWare\n- Upgradeable contracts with multisig control\n- Escape hatch exists but requires specific conditions and has operational complexity\n- Governance transitioning toward decentralization but not yet complete\n\n#### 3.3.3 Scroll and Linea\n\nBoth represent newer zkEVM implementations:\n\n**Scroll:**\n- Type 2 zkEVM (EVM-equivalent at bytecode level)\n- Uses a combination of KZG commitments and custom proving system\n- Decentralized prover network in development\n- Currently centralized sequencing and proving with roadmap toward decentralization\n\n**Linea:**\n- Developed by Consensys\n- Type 2 zkEVM with Lattice-based proof system\n- Centralized operations with published decentralization roadmap\n- Benefits from Consensys infrastructure but inherits single-operator risks\n\n### 3.4 Comparative Analysis\n\n```\nDecentralization Spectrum (January 2025)\n\nStage 2: [None]\n         |\nStage 1: [Arbitrum One]\n         |\nStage 0: [Base, OP Mainnet, zkSync Era, Starknet, Scroll, Linea, ...]\n         |\nCentralized: [Various app-specific rollups, new launches]\n```\n\nThe clustering at Stage 0 reflects both the technical difficulty of advancement and the recency of many implementations. Notably, the transition from Stage 0 to Stage 1 requires not just technical implementation but sufficient operational history to justify reduced governance intervention capabilities.\n\n---\n\n## 4. Critical Bottlenecks\n\n### 4.1 Proof System Maturity\n\n#### 4.1.1 Optimistic Rollup Challenges\n\nFraud proof systems face several fundamental challenges:\n\n**Complexity of Dispute Resolution:**\nThe fraud proof game requires proving that a specific instruction in a potentially billions-long execution trace was computed incorrectly. This involves:\n\n1. Interactive bisection to identify the disputed instruction\n2. One-step proof execution on L1\n3. Handling of edge cases (memory access, precompiles, cross-contract calls, etc.)\n\nArbitrum's BOLD protocol addresses the \"delay attack\" vulnerability where malicious actors could indefinitely postpone fraud proof resolution by posting multiple invalid claims. BOLD bounds the maximum delay regardless of attacker resources, but introduces its own complexity and capital requirements for defenders.\n\n**The Verifier's Dilemma:**\nRational validators may not monitor for fraud if the expected cost exceeds the expected reward. This creates scenarios where fraud could go unchallenged during periods of:\n- Low attention (holidays, competing events)\n- High gas prices making challenges expensive\n- Coordination failures among potential challengers\n\nResearch by Thibault et al. (2024) formalizes this dilemma and proposes mechanism design solutions, but production implementations remain limited.\n\n#### 4.1.2 ZK-Rollup Challenges\n\nZK-rollups face different but equally significant challenges:\n\n**Proof Generation Costs:**\nGenerating validity proofs remains computationally expensive. The costs vary dramatically based on proof system choice and circuit complexity:\n\n| Proof System | Proof Size | Prover Time (per tx) | Verifier Time | Trusted Setup |\n|--------------|------------|---------------------|---------------|---------------|\n| Groth16 | ~200 bytes | High | ~3ms | Required (circuit-specific) |\n| PLONK (KZG) | ~400 bytes | Medium-High | ~5ms | Required (universal) |\n| STARKs (FRI) | ~50-200 KB | Medium | ~10-50ms | None |\n| Halo2 (IPA) | ~5 KB | High | ~50ms | None |\n\n*Approximate figures; actual performance depends on circuit size, hardware, and implementation optimization.*\n\nThese costs create centralization pressure, as only well-resourced operators can afford proving infrastructure at scale.\n\n**Circuit Completeness and Soundness:**\nZK circuits must correctly encode all EVM opcodes and edge cases. The audit surface is enormous:\n\n- Compiler correctness (high-level language to circuit constraints)\n- Constraint system completeness (all execution paths properly constrained)\n- Prover implementation (no bugs allowing false proofs)\n- Verifier implementation (no bugs accepting invalid proofs)\n\nBugs in circuit design can lead to:\n- Invalid state transitions being accepted (soundness failure)\n- Valid transactions being rejected (completeness failure)\n- Exploitable vulnerabilities allowing fund theft\n\n**Cryptographic Security Assumptions:**\nDifferent proof systems rely on different cryptographic assumptions with varying confidence levels:\n\n| Assumption | Proof Systems | Post-Quantum | Confidence |\n|------------|---------------|--------------|------------|\n| Discrete Log (Elliptic Curves) | Groth16, PLONK (KZG) | No | High |\n| Random Oracle Model | Most systems | Varies | High |\n| Algebraic Group Model | PLONK, Groth16 | No | Medium-High |\n| Collision-Resistant Hashing | STARKs | Yes | Very High |\n| Knowledge of Exponent | Groth16 | No | Medium |\n\nSTARKs' reliance on hash function security provides post-quantum resistance but at the cost of larger proof sizes. This tradeoff influences long-term architectural decisions.\n\n**Prover Centralization:**\nCurrently, all major ZK-rollups use centralized provers:\n\n```\nTransaction Flow (Current):\nUser → Centralized Sequencer → Centralized Prover → L1 Verification\n\nIdeal Flow:\nUser → Decentralized Sequencer Network → Decentralized Prover Market → L1 Verification\n```\n\nDecentralizing proving requires solving proof generation latency, prover selection mechanisms, and economic incentive alignment.\n\n### 4.2 Sequencer Decentralization\n\nThe sequencer—the entity that orders transactions and produces blocks—represents the most significant centralization point in current rollups.\n\n#### 4.2.1 Current Centralization\n\nAll major rollups operate centralized sequencers:\n\n| Rollup | Sequencer Operator | Revenue Model | Geographic Distribution |\n|--------|-------------------|---------------|------------------------|\n| Arbitrum One | Offchain Labs | MEV + priority fees | Single operator |\n| Base | Coinbase | Transaction fees | Single operator |\n| OP Mainnet | Optimism Foundation | Transaction fees | Single operator |\n| zkSync Era | Matter Labs | Transaction fees | Single operator |\n\nCentralized sequencers create multiple risk categories:\n\n- **Censorship**: Operators can exclude specific transactions or addresses\n- **MEV extraction**: Operators capture ordering value without competitive redistribution\n- **Liveness**: Single point of failure for transaction inclusion\n- **Regulatory capture**: Identifiable operators subject to legal pressure in their jurisdictions\n\n#### 4.2.2 Decentralization Approaches\n\nSeveral approaches to sequencer decentralization are under development:\n\n**Leader Rotation:**\nValidators take turns as sequencer based on stake weight or verifiable random selection.\n\n*Technical Challenges:*\n- Latency increases from geographic distribution and leader handoff\n- MEV distribution complexity across rotating leaders\n- Validator set management and stake security\n- Potential for leader extraction during their slot\n\n**Based Sequencing:**\nEthereum L1 validators/proposers sequence L2 transactions, inheriting L1's decentralization directly. Projects like Taiko are exploring this model.\n\n*Advantages:*\n- Immediate inheritance of L1 decentralization (~900,000 validators)\n- No separate validator set to bootstrap\n- Atomic L1-L2 composability potential\n- Credible neutrality from L1 proposer selection\n\n*Challenges:*\n- Reduced L2 sovereignty (can't implement custom ordering rules)\n- Block time limited to L1 (~12 seconds vs. sub-second L2 blocks)\n- Cross-domain MEV complications where L1 proposers extract L2 value\n- Proposer-builder separation (PBS) interactions add complexity\n\n**Shared Sequencing:**\nMultiple rollups share a decentralized sequencer network (e.g., Espresso Systems, Astria, Radius).\n\n```\nShared Sequencing Architecture:\n\n        ┌─────────────────────┐\n        │   Shared Sequencer  │\n        │      Network        │\n        │  (HotShot/Astria)   │\n        └──────────┬──────────┘\n                   │\n    ┌──────────────┼──────────────┐\n    │              │              │\n    ▼              ▼              ▼\n┌────────┐    ┌────────┐    ┌────────┐\n│Rollup A│    │Rollup B│    │Rollup C│\n│        │    │        │    │        │\n└────────┘    └────────┘    └────────┘\n```\n\n*Advantages:*\n- Atomic cross-rollup transactions possible\n- Shared security across participant rollups\n- Economies of scale for decentralization infrastructure\n\n*Challenges:*\n- Consensus mechanism must provide fast finality (Espresso's HotShot, Astria's CometBFT)\n- Value distribution across rollups and sequencer operators\n- Governance coordination across independent ecosystems\n- Dependency on external infrastructure availability\n\n#### 4.2.3 MEV Considerations in Decentralized Sequencing\n\nMEV (Maximal Extractable Value) redistribution is a critical unsolved problem:\n\n**Current State:**\n- Centralized sequencers capture 100% of MEV\n- Some rollups implement MEV-share mechanisms (e.g., Arbitrum's Timeboost)\n- No standardized approach to MEV redistribution\n\n**Proposed Solutions:**\n- *Encrypted mempools*: Transactions encrypted until ordering committed (threshold encryption, delay encryption)\n- *MEV auctions*: Competitive bidding for ordering rights with proceeds distributed\n- *Fair ordering*: First-come-first-served or batch auctions eliminating ordering-based extraction\n- *MEV-burn*: Captured MEV burned or distributed to users\n\nEach approach involves tradeoffs between extraction prevention, latency, complexity, and economic efficiency.\n\n### 4.3 Security Council Governance\n\n#### 4.3.1 The Upgrade Dilemma\n\nRollups face a fundamental tension:\n\n- **Upgradeability enables bug fixes**: Critical vulnerabilities require rapid response capability\n- **Upgradeability enables attacks**: Malicious upgrades can steal all user funds\n\nThis tension is particularly acute for systems securing billions of dollars where both risks are existential.\n\n#### 4.3.2 Security Council Structures: Comparative Analysis\n\nSecurity Councils vary significantly in their design and operation:\n\n**Arbitrum Security Council:**\n- **Composition**: 12 members from diverse ecosystem organizations\n- **Threshold**: 9/12 for emergency actions, 7/12 for non-emergency upgrades\n- **Selection**: Members elected by ARB token holders through on-chain governance\n- **Constraints**: Operates under Arbitrum Constitution defining scope and limitations\n- **Accountability**: Public member identities, election cycles, removal procedures\n- **Geographic Distribution**: Members span multiple jurisdictions to reduce regulatory capture risk\n\n**Optimism Security Council:**\n- **Composition**: 13 members in nested multisig structure\n- **Threshold**: Varies by action type\n- **Selection**: Foundation-appointed with planned transition to elected\n- **Constraints**: Can pause fault proofs via Guardian role\n- **Accountability**: Less formal accountability framework currently\n- **Relationship to Foundation**: Optimism Foundation maintains significant influence\n\n**Comparative Assessment:**\n\n| Dimension | Arbitrum | Optimism | zkSync Era |\n|-----------|----------|----------|------------|\n| Member Selection | Elected | Appointed | Company-controlled |\n| Public Identities | Yes | Partial | Limited |\n| Constitutional Constraints | Yes | Developing | No |\n| Emergency Threshold | 9/12 | Variable | Not disclosed |\n| Removal Mechanism | Token vote | Foundation | None |\n\n#### 4.3.3 Governance Attack Vectors\n\nSecurity Councils introduce specific attack vectors that Stage 2 would eliminate:\n\n**Social Engineering:**\n- Council members can be individually targeted through phishing, impersonation, or social manipulation\n- Compromise of member keys enables participation in malicious upgrades\n- Mitigation: Hardware security modules, operational security training, key rotation\n\n**Regulatory Coercion:**\n- Identifiable members in specific jurisdictions can face legal pressure\n- Government actors could compel upgrade cooperation\n- Mitigation: Geographic distribution, legal structures, threshold requirements exceeding any single jurisdiction's reach\n\n**Economic Incentives:**\n- Council members could be bribed to participate in malicious upgrades\n- Profit from upgrade (stealing TVL) could exceed members' reputation value\n- Mitigation: Staking requirements, insurance, criminal liability\n\n**Coordination Attacks:**\n- Subset of members could secretly coordinate malicious action\n- Communication channels between members create coordination surfaces\n- Mitigation: High thresholds, diverse member selection, monitoring\n\n#### 4.3.4 Historical Governance Decisions: Case Studies\n\nExamining actual governance decisions illuminates how councils function:\n\n**Arbitrum AIP-1 Controversy (2023):**\n- Foundation allocated 750M ARB tokens before governance ratification\n- Community backlash over perceived governance bypass\n- Resolution: Foundation committed to governance oversight\n- Lesson: Governance legitimacy requires process adherence even for benign actions\n\n**Optimism Retroactive Public Goods Funding:**\n- Citizens' House allocates funds to public goods contributors\n- Novel bicameral structure separating token voting from citizenship\n- Demonstrates governance innovation beyond simple multisig\n- Ongoing experiment in non-plutocratic blockchain governance\n\n**zkSync Era Upgrade Patterns:**\n- Multiple upgrades executed with limited public deliberation\n- Centralized control enables rapid iteration but reduces transparency\n- Community trust based on Matter Labs' reputation rather than formal constraints\n\n#### 4.3.5 Path to Governance Minimization\n\nAchieving Stage 2 requires governance minimization through multiple mechanisms:\n\n**Extended Timelocks:**\n- 30+ day delays allow users to exit before malicious upgrades execute\n- Requires confidence that no bug requires faster response\n- Creates tension with security incident response needs\n\n**Constrained Upgrade Scope:**\n- Limit what upgrades can modify (e.g., cannot change withdrawal logic)\n- Formal verification that upgrade constraints are enforced\n- Reduces attack surface even with short timelocks\n\n**Immutability Progression:**\n- Core contracts become non-upgradeable after sufficient battle-testing\n- Upgrades limited to peripheral components\n- Eventual full immutability for critical paths\n\n**Exit-Focused Design:**\n- Prioritize that users can always exit regardless of governance\n- Ensure withdrawal paths remain functional even during disputes\n- Time-bound governance powers that expire without renewal\n\n### 4.4 Data Availability Security Models\n\n#### 4.4.1 Ethereum Native Data Availability\n\nEIP-4844 introduced blob transactions providing dedicated rollup data space:\n\n**Current Specifications:**\n- Target: 3 blobs per block (~375 KB)\n- Maximum: 6 blobs per block (~750 KB)\n- Blob size: 128 KB each\n- Retention: ~18 days before pruning\n- Cost: Separate fee market from execution gas\n\n**Security Model:**\n- Full nodes download and verify all blob data\n- Data availability guaranteed by Ethereum's full validator set\n- No sampling assumptions—complete data verification\n- Highest security tier for rollup data availability\n\n#### 4.4.2 Alternative Data Availability Layers\n\nSome projects use external DA layers, creating \"validiums\" with different security properties:\n\n**Celestia:**\n- *Mechanism*: Data Availability Sampling (DAS) with erasure coding\n- *Security Model*: Light clients sample random chunks; statistical guarantee of availability\n- *Validator Set*: Independent PoS consensus (~100 validators currently)\n- *Trust Assumption*: Honest minority of samplers + validator honesty\n\n**EigenDA:**\n- *Mechanism*: Data distributed across restaked ETH operators\n- *Security Model*: Cryptoeconomic security via slashing conditions\n- *Validator Set*: Ethereum restakers opted into EigenDA AVS\n- *Trust Assumption*: Economic rationality of restakers + slashing effectiveness\n\n**Avail:**\n- *Mechanism*: DAS similar to Celestia with KZG commitments\n- *Security Model*: Light client sampling with validity proofs\n- *Validator Set*: Independent PoS consensus\n- *Trust Assumption*: Similar to Celestia\n\n**Security Comparison:**\n\n| DA Layer | Security Source | Validator Count | Post-Quantum | Data Retention |\n|----------|-----------------|-----------------|--------------|----------------|\n| Ethereum Blobs | Full verification | ~900,000 | No (secp256k1) | ~18 days |\n| Celestia | DAS + consensus | ~100 | No | Configurable |\n| EigenDA | Restaked ETH | Variable | No | Configurable |\n| Avail | DAS + consensus | ~100 | No | Configurable |\n\n#### 4.4.3 Security Degradation Analysis\n\nMoving from Ethereum DA to alternative layers introduces quantifiable security degradation:\n\n**Validator Set Size:**\n- Ethereum: ~900,000 validators with ~30M ETH staked\n- Alternative layers: 100-1000 validators with significantly less stake\n- Attack cost difference: Orders of magnitude\n\n**Consensus Independence:**\n- Ethereum DA: Security inherited from battle-tested consensus\n- Alternative DA: Separate consensus with independent failure modes\n- Correlation risk: Alternative DA failure doesn't affect Ethereum, but affects rollup\n\n**Economic Security:**\n```\nEthereum DA Security Budget: ~30M ETH × $3000 = ~$90B at stake\nCelestia Security Budget: ~100M TIA × $10 = ~$1B at stake\nEigenDA Security Budget: Subset of restaked ETH, variable\n\nAttack cost ratio: ~90:1 (Ethereum vs. Celestia)\n```\n\n**Implications for Rollup Classification:**\nRollups using alternative DA are properly classified as \"validiums\" rather than \"rollups\" because:\n1. Data availability is not guaranteed by Ethereum consensus\n2. Users cannot reconstruct state from Ethereum alone\n3. Additional trust assumptions beyond L1 security\n\nThis distinction matters for Stage classification—a system cannot achieve Stage 2 trustlessness while relying on external DA with weaker security guarantees than Ethereum.\n\n### 4.5 Cross-Rollup Interoperability and Bridging\n\n#### 4.5.1 The Fragmentation Problem\n\nThe rollup-centric roadmap creates ecosystem fragmentation:\n- Liquidity split across dozens of rollups\n- Users must bridge assets between networks\n- Application state isolated within individual rollups\n- User experience degraded by bridging complexity\n\n#### 4.5.2 Bridge Security Models\n\nDifferent bridging approaches carry different trust assumptions:\n\n**Canonical Bridges:**\n- Operated by rollup teams as \"official\" bridge\n- Security tied to rollup's own upgrade mechanisms\n- Trust assumption: Same as rollup itself (Security Council can modify)\n- Example: Arbitrum Bridge, Optimism Gateway\n\n*Critical Observation*: A Stage 1 rollup with a canonical bridge controlled by its Security Council inherits the council's trust assumptions for bridged assets. Users bridging to a \"Stage 1\" rollup still trust the council.\n\n**Light Client Bridges:**\n- Verify source chain consensus on destination chain\n- Trust assumption: Consensus mechanism security + light client implementation correctness\n- Challenge: ZK light clients expensive to verify on-chain; optimistic light clients have delay\n\n**Trusted/Federated Bridges:**\n- Multisig or MPC committee attests to cross-chain state\n- Trust assumption: Honesty of bridge operators (often 2/3 or 3/5 threshold)\n- Examples: Many third-party bridges (Multichain, Wormhole pre-upgrade)\n- Risk: Bridge operator compromise enables fund theft (multiple historical exploits)\n\n**Intent-Based Systems:**\n- Users express intent; solvers fulfill across chains\n- Trust assumption: Solver competition + settlement mechanism security\n- Examples: Across Protocol, UniswapX cross-chain\n- Trade-off: Capital efficiency vs. trust minimization\n\n#### 4.5.3 Bridge Security and Rollup Stage Interaction\n\nA critical but often overlooked question: **How do bridge trust assumptions interact with rollup stage classifications?**\n\nConsider a user's end-to-end security:\n\n```\nUser Journey: Ethereum → Rollup A → Rollup B → Ethereum\n\nTrust assumptions accumulated:\n1. Rollup A's proof system and governance\n2. Bridge A→B's security model\n3. Rollup B's proof system and governance\n4. Exit bridge security\n\nWeakest link determines actual security.\n```\n\n**Implications:**\n- A Stage 2 rollup connected only via trusted bridges provides Stage 2 security only for native assets\n- Cross-rollup DeFi inherits the weakest bridge's security\n- Users may believe they have Stage 1/2 security while actually trusting bridge operators\n\n#### 4.5.4 Toward Trustless Interoperability\n\nAchieving trustless cross-rollup communication requires:\n\n**Shared Settlement:**\n- Rollups settling on same L1 can verify each other's state roots\n- Requires waiting for finality on both rollups\n- Latency: Challenge period (optimistic) or proof generation (ZK)\n\n**ZK Light Clients:**\n- Prove source chain consensus in ZK\n- Verify proof on destination chain\n- Projects: Succinct, Polymer, zkBridge\n- Challenge: Proving consensus is expensive; recursive proofs help\n\n**Shared Sequencing with Atomic Inclusion:**\n- Shared sequencer guarantees atomic transaction inclusion\n- Enables atomic cross-rollup operations\n- Requires rollups to adopt shared sequencer\n\n**Standardization Efforts:**",
  "manuscript_final_v3": "# Rollup Stages: Current Landscape, Challenges, and the Path to Full Decentralization\n\n## A Comprehensive Research Report on Layer 2 Scaling Solutions\n\n---\n\n## Executive Summary\n\nRollups have emerged as the dominant paradigm for scaling Ethereum and other Layer 1 blockchains, processing billions of dollars in transactions while inheriting the security guarantees of their underlying networks. However, the journey from centralized sequencers to fully decentralized, trustless systems remains incomplete. This report provides a comprehensive analysis of the rollup maturity framework, examining the current state of major rollup implementations, identifying critical bottlenecks preventing progression to higher stages, and evaluating emerging solutions.\n\nOur analysis reveals that as of early 2025, the vast majority of rollups by Total Value Locked (TVL) remain at Stage 0, with Arbitrum One representing the most advanced major rollup at Stage 1. Stage 2—the highest level of decentralization where users can exit without any trust assumptions beyond L1 security and cryptographic soundness—remains unachieved by any major rollup. Key bottlenecks include incomplete proof system maturity, centralized sequencer architectures, Security Council governance structures with broad upgrade powers, and the absence of robust cross-rollup interoperability with appropriate trust guarantees.\n\nThis report examines these challenges through technical, economic, and governance lenses, providing actionable insights for researchers, developers, and stakeholders invested in the rollup ecosystem's maturation. We conclude that while the technical foundations for Stage 2 rollups exist, achieving this milestone requires coordinated advances in proof systems, decentralized sequencing, governance minimization, and cross-rollup bridging infrastructure over the next 24-48 months.\n\n---\n\n## 1. Introduction\n\n### 1.1 The Scaling Imperative\n\nEthereum's transition to proof-of-stake and the implementation of EIP-4844 (Proto-Danksharding) have established a clear roadmap: the base layer optimizes for security and data availability, while execution scales through Layer 2 solutions. This \"rollup-centric\" roadmap, articulated by Vitalik Buterin in 2020, has fundamentally shaped blockchain architecture.\n\nRollups execute transactions off-chain while posting transaction data (or state differences) to the parent chain, achieving throughput improvements of 10-100x while maintaining security guarantees derived from the underlying Layer 1. As of January 2025, rollups collectively secure over $40 billion in TVL and process more daily transactions than Ethereum mainnet.\n\n### 1.2 The Trust Spectrum\n\nDespite their promise, rollups exist on a spectrum of decentralization and trustlessness. Early implementations required users to trust operators completely—a regression from blockchain's core value proposition. The community recognized this tension, leading to the development of maturity frameworks that track rollups' progression toward full decentralization.\n\n### 1.3 Research Objectives\n\nThis report addresses four primary questions:\n\n1. What constitutes a mature, trustless rollup, and how do we measure progress toward this goal?\n2. What is the current state of major rollup implementations relative to these standards?\n3. What technical, economic, and governance bottlenecks prevent advancement, and what solutions are emerging?\n4. How do cross-rollup interoperability and bridging mechanisms affect the practical security of the rollup ecosystem?\n\n---\n\n## 2. The Rollup Stage Framework\n\n### 2.1 Origins and Rationale\n\nThe rollup stage framework was formalized by L2Beat, the leading Layer 2 analytics platform, in collaboration with the Ethereum research community. The framework emerged from recognition that marketing claims about \"decentralization\" and \"security\" required objective, verifiable criteria.\n\nThe framework defines three stages (0, 1, and 2), each representing increasing levels of trustlessness and decentralization. Critically, the framework focuses on **exit guarantees**—the ability of users to withdraw their funds without relying on any trusted party.\n\n### 2.2 Stage Definitions\n\n#### Stage 0: Full Training Wheels\n\nAt Stage 0, a rollup has deployed on mainnet but retains significant centralized control. The defining characteristics include:\n\n- **Centralized sequencing**: A single operator orders and executes transactions\n- **Upgradeable contracts**: The rollup's smart contracts can be modified without delay or with minimal timelock\n- **No fraud/validity proofs**: Users cannot independently verify state transitions, or proofs exist but can be overridden\n- **Operator-dependent exits**: Users rely on the operator to process withdrawals\n\nStage 0 rollups are functionally similar to sidechains with additional data availability guarantees. Users must trust that operators will not censor transactions, steal funds through malicious upgrades, or abandon the network.\n\n#### Stage 1: Limited Training Wheels\n\nStage 1 represents meaningful progress toward trustlessness:\n\n- **Functional proof system**: Either fraud proofs (optimistic rollups) or validity proofs (ZK-rollups) are deployed and operational\n- **Permissionless verification**: Anyone can submit fraud proofs or verify validity proofs\n- **Escape hatch mechanism**: Users can force withdrawals through the L1 if the operator becomes unresponsive\n- **Security Council**: A multisig can intervene in case of bugs, but with significant constraints (typically requiring supermajority threshold)\n\nThe key advancement at Stage 1 is that **users can exit without operator cooperation**, though they may still need to trust a Security Council for bug fixes during an interim period.\n\n#### Stage 2: No Training Wheels\n\nStage 2 represents full trustlessness:\n\n- **Immutable or governance-minimized contracts**: Upgrades require extended timelocks (30+ days) or are impossible\n- **No Security Council override**: Or the council can only act after the timelock expires, giving users time to exit\n- **Battle-tested proof system**: The proof mechanism has been operational without critical failures for an extended period\n- **Decentralized sequencing**: Multiple parties can propose blocks, eliminating single points of failure (or users can self-sequence via L1)\n\nAt Stage 2, the rollup inherits Ethereum's security guarantees fully. Users need only trust the L1 consensus and the mathematical soundness of the proof system.\n\n### 2.3 Framework Limitations and Ongoing Debates\n\nThe stage framework, while valuable, has acknowledged limitations:\n\n1. **Binary categorization**: Rollups may meet some but not all criteria for a stage, creating edge cases where classification is contested\n2. **Implementation nuance**: Two Stage 1 rollups may have significantly different security properties depending on Security Council structure, proof system maturity, and escape hatch robustness\n3. **Dynamic assessment**: A rollup's stage can regress if vulnerabilities are discovered or if governance decisions weaken security guarantees\n4. **Scope limitations**: The framework doesn't directly assess liveness, MEV extraction, economic security, or cross-rollup bridging trust assumptions\n5. **Classification disputes**: Stage classifications are sometimes contested by rollup teams or community members who interpret criteria differently; readers should consult L2Beat directly for current classifications and understand the methodology behind disputed assessments\n\n---\n\n## 3. Current Landscape Analysis\n\n### 3.1 Market Overview\n\nAs of January 2025, the rollup ecosystem comprises over 50 active networks with combined TVL exceeding $40 billion. The market is dominated by a small number of major players:\n\n| Rollup | Type | TVL (USD) | Stage | Launch Date |\n|--------|------|-----------|-------|-------------|\n| Arbitrum One | Optimistic | ~$15B | 1 | August 2021 |\n| Base | Optimistic | ~$12B | 0 | August 2023 |\n| OP Mainnet | Optimistic | ~$7B | 0 | December 2021 |\n| zkSync Era | ZK | ~$1B | 0 | March 2023 |\n| Starknet | ZK | ~$500M | 0 | November 2022 |\n| Linea | ZK | ~$800M | 0 | July 2023 |\n| Scroll | ZK | ~$600M | 0 | October 2023 |\n\n*Data approximate as of January 2025. Stage classifications per L2Beat methodology and subject to change. Readers should verify current status at l2beat.com.*\n\n### 3.2 Optimistic Rollups: Detailed Assessment\n\n#### 3.2.1 Arbitrum One\n\nArbitrum One, developed by Offchain Labs, represents the most mature optimistic rollup implementation. Key characteristics:\n\n**Stage 1 Qualifications:**\n- Deployed BOLD (Bounded Liquidity Delay) fraud proof system in late 2024\n- Permissionless validation enabled—anyone can challenge invalid state roots\n- Functional escape hatch through `forceInclusion` mechanism allowing users to submit transactions directly to L1\n- 6 day, 8 hour challenge period for fraud proofs\n\n**Remaining Limitations:**\n- Security Council (12-member multisig) can upgrade contracts with a 3-day delay for non-emergency actions\n- Emergency upgrades require 9/12 threshold but can bypass timelock\n- Sequencer remains centralized (operated by Offchain Labs)\n- Council can pause the system in emergencies\n\nThe Security Council's powers represent the primary barrier to Stage 2. While the council provides important bug-fix capabilities, its ability to execute emergency upgrades creates trust assumptions that Stage 2 would eliminate.\n\n#### 3.2.2 Optimism (OP Mainnet)\n\nOP Mainnet, the flagship chain of the OP Stack, has made significant progress but remains at Stage 0:\n\n**Current State:**\n- Fault proof system (FPAC - Fault Proof Alpha Cannon) launched in June 2024\n- Permissionless proposers enabled\n- 7-day challenge window\n\n**Stage 0 Classification Rationale:**\n- Guardian role can disable fault proofs entirely, reverting to permissioned output proposals\n- Deputy Guardian can pause withdrawals\n- Security Council can upgrade without delay in emergency situations\n- Proof system relatively new, requiring more battle-testing before governance constraints can be safely reduced\n\nThe OP Stack's modular design means improvements benefit the entire Superchain ecosystem (Base, Mode, Zora, etc.), but this also means vulnerabilities affect multiple networks simultaneously—a systemic risk consideration.\n\n#### 3.2.3 Base\n\nBase, developed by Coinbase, is the largest Stage 0 rollup by TVL:\n\n**Current Limitations:**\n- Inherits OP Stack limitations including Guardian override capabilities\n- Additional Coinbase operational dependencies\n- Relies on Optimism's Security Council rather than independent governance\n- Sequencer operated by Coinbase with no current decentralization timeline\n\nBase's rapid growth ($12B+ TVL) despite Stage 0 status highlights that users currently prioritize other factors (UX, ecosystem, institutional backing, regulatory clarity) over decentralization metrics—a finding with implications for the pace of ecosystem-wide decentralization.\n\n### 3.3 ZK-Rollups: Detailed Assessment\n\n#### 3.3.1 zkSync Era\n\nzkSync Era, developed by Matter Labs, is the largest ZK-rollup by TVL:\n\n**Technical Architecture:**\n- Uses a customized PLONK-based proof system (specifically a variant with custom gates and lookup arguments)\n- Boojum prover utilizing FRI-based polynomial commitments for improved efficiency\n- EVM-equivalent execution environment via zkEVM\n\n**Stage 0 Limitations:**\n- Validity proofs cover state transitions but the system retains centralized override capabilities\n- Centralized sequencer and prover operated by Matter Labs\n- Upgradeable contracts with Security Council control\n- Escape hatch mechanism exists but has not been battle-tested in adversarial conditions\n\n#### 3.3.2 Starknet\n\nStarknet, developed by StarkWare, uses STARK proofs:\n\n**Technical Characteristics:**\n- Cairo VM (not EVM-equivalent, requiring contract rewriting or transpilation)\n- Recursive proofs for scalability via SHARP (Shared Prover)\n- FRI-based polynomial commitments providing post-quantum security assumptions\n\n**Current Limitations:**\n- Centralized sequencer operated by StarkWare\n- Upgradeable contracts with multisig control\n- Escape hatch exists but requires specific conditions and has operational complexity\n- Governance transitioning toward decentralization but not yet complete\n\n#### 3.3.3 Scroll and Linea\n\nBoth represent newer zkEVM implementations:\n\n**Scroll:**\n- Type 2 zkEVM (EVM-equivalent at bytecode level)\n- Uses a combination of KZG commitments and custom proving system\n- Decentralized prover network in development\n- Currently centralized sequencing and proving with roadmap toward decentralization\n\n**Linea:**\n- Developed by Consensys\n- Type 2 zkEVM with Lattice-based proof system\n- Centralized operations with published decentralization roadmap\n- Benefits from Consensys infrastructure but inherits single-operator risks\n\n### 3.4 Comparative Analysis\n\n```\nDecentralization Spectrum (January 2025)\n\nStage 2: [None]\n         |\nStage 1: [Arbitrum One]\n         |\nStage 0: [Base, OP Mainnet, zkSync Era, Starknet, Scroll, Linea, ...]\n         |\nCentralized: [Various app-specific rollups, new launches]\n```\n\nThe clustering at Stage 0 reflects both the technical difficulty of advancement and the recency of many implementations. Notably, the transition from Stage 0 to Stage 1 requires not just technical implementation but sufficient operational history to justify reduced governance intervention capabilities.\n\n---\n\n## 4. Critical Bottlenecks\n\n### 4.1 Proof System Maturity\n\n#### 4.1.1 Optimistic Rollup Challenges\n\nFraud proof systems face several fundamental challenges:\n\n**Complexity of Dispute Resolution:**\nThe fraud proof game requires proving that a specific instruction in a potentially billions-long execution trace was computed incorrectly. This involves:\n\n1. Interactive bisection to identify the disputed instruction\n2. One-step proof execution on L1\n3. Handling of edge cases (memory access, precompiles, cross-contract calls, etc.)\n\nArbitrum's BOLD protocol addresses the \"delay attack\" vulnerability where malicious actors could indefinitely postpone fraud proof resolution by posting multiple invalid claims. BOLD bounds the maximum delay regardless of attacker resources, but introduces its own complexity and capital requirements for defenders.\n\n**The Verifier's Dilemma:**\nRational validators may not monitor for fraud if the expected cost exceeds the expected reward. This creates scenarios where fraud could go unchallenged during periods of:\n- Low attention (holidays, competing events)\n- High gas prices making challenges expensive\n- Coordination failures among potential challengers\n\nResearch by Thibault et al. (2024) formalizes this dilemma and proposes mechanism design solutions, but production implementations remain limited.\n\n#### 4.1.2 ZK-Rollup Challenges\n\nZK-rollups face different but equally significant challenges:\n\n**Proof Generation Costs and Batched Economics:**\nGenerating validity proofs remains computationally expensive. Critically, ZK-rollups do not prove individual transactions but rather batches of thousands of transactions, amortizing proving costs across the batch. The relevant metrics are therefore proving throughput and batch finalization latency rather than per-transaction costs:\n\n| Proof System | Proof Size | Proving Throughput | Batch Size | L1 Verification Cost | Trusted Setup |\n|--------------|------------|-------------------|------------|---------------------|---------------|\n| Groth16 | ~200 bytes | ~1-5 TPS | 1000-5000 tx | ~230K gas | Required (circuit-specific) |\n| PLONK (KZG) | ~400 bytes | ~5-15 TPS | 1000-10000 tx | ~300K gas | Required (universal) |\n| STARKs (FRI) | ~50-200 KB | ~10-50 TPS | 5000-20000 tx | ~1-5M gas | None |\n| Halo2 (IPA) | ~5 KB | ~2-10 TPS | 1000-5000 tx | ~500K gas | None |\n\n*Throughput figures reflect current production implementations with GPU acceleration. Actual performance varies significantly based on circuit complexity, hardware, and optimization level.*\n\nFor context, zkSync Era's Boojum prover achieves approximately 10 TPS proving throughput through parallelization and GPU acceleration. Scroll's proving pipeline separates EVM trace generation from constraint satisfaction, enabling different optimization strategies for each phase.\n\n**Hardware Acceleration and Prover Infrastructure:**\nCurrent proving infrastructure relies heavily on hardware acceleration:\n\n- **GPU Proving**: Most production provers use CUDA-optimized implementations, achieving 10-100x speedups over CPU proving\n- **FPGA Development**: Several teams (Ingonyama, Cysic) are developing FPGA-based provers for improved efficiency\n- **ASIC Prospects**: Purpose-built proving ASICs could provide further order-of-magnitude improvements but require significant capital investment and introduce centralization concerns\n\nThe capital requirements for competitive proving infrastructure create natural centralization pressure, as only well-resourced operators can afford state-of-the-art hardware.\n\n**Circuit Completeness and Soundness:**\nZK circuits must correctly encode all EVM opcodes and edge cases. The audit surface is enormous:\n\n- Compiler correctness (high-level language to circuit constraints)\n- Constraint system completeness (all execution paths properly constrained)\n- Prover implementation (no bugs allowing false proofs)\n- Verifier implementation (no bugs accepting invalid proofs)\n\nBugs in circuit design can lead to:\n- Invalid state transitions being accepted (soundness failure)\n- Valid transactions being rejected (completeness failure)\n- Exploitable vulnerabilities allowing fund theft\n\n**Cryptographic Security Assumptions:**\nDifferent proof systems rely on different cryptographic assumptions with varying confidence levels:\n\n| Assumption | Proof Systems | Post-Quantum | Confidence | Notes |\n|------------|---------------|--------------|------------|-------|\n| Discrete Log (Elliptic Curves) | Groth16, PLONK (KZG) | No | High | Well-studied, decades of cryptanalysis |\n| Random Oracle Model | Most systems | Varies | High | Standard model alternative exists for some |\n| Algebraic Group Model | PLONK, Groth16 | No | Medium-High | Relatively newer assumption |\n| Collision-Resistant Hashing | STARKs | Yes | Very High | Minimal assumptions |\n| Knowledge of Exponent (KEA) | Groth16 | No | Medium | Non-falsifiable assumption; genuine long-term concern |\n\nThe Knowledge of Exponent assumption underlying Groth16 deserves particular attention: it is non-falsifiable (cannot be proven false even if incorrect), representing a qualitatively different security foundation than falsifiable assumptions. This motivates the industry trend toward PLONK-based systems with universal trusted setups.\n\n**Trusted Setup Considerations:**\nThe trusted setup burden varies significantly:\n\n- **Circuit-specific setups (Groth16)**: Each circuit requires a new ceremony; compromise of any ceremony's toxic waste enables proof forgery\n- **Universal setups (PLONK with KZG)**: A single ceremony (e.g., Aztec's Ignition with 176 participants, Zcash's Powers of Tau) can be reused across all circuits, dramatically reducing practical burden\n- **Transparent setups (STARKs, Halo2 with IPA)**: No trusted setup required; security relies only on hash function collision resistance\n\n#### 4.1.3 Recursive Proofs and Proof Aggregation\n\nA critical area omitted from many rollup analyses is the role of recursive proof composition in addressing scalability bottlenecks:\n\n**Recursive Proof Fundamentals:**\nRecursive proofs allow a proof to verify other proofs, enabling:\n- Proof aggregation: Multiple transaction batch proofs combined into a single proof\n- Incremental verification: Proving correctness of computation that includes previous proof verification\n- Compression: Reducing L1 verification costs by posting a single proof for many batches\n\n**Production Implementations:**\n\n*Starknet's SHARP (Shared Prover):*\nSHARP aggregates proofs from multiple applications (Starknet, StarkEx-based systems) into recursive proof trees, amortizing L1 verification costs across all participants. A single L1 proof can attest to millions of transactions across multiple applications.\n\n*Polygon zkEVM's STARK-to-SNARK Wrapping:*\nPolygon zkEVM generates STARK proofs for execution (benefiting from no trusted setup and post-quantum security) then proves STARK verification inside a SNARK circuit for L1 submission. This provides:\n- STARK security properties for execution proving\n- SNARK efficiency (~230K gas) for L1 verification\n- Practical solution to the proof size vs. verification cost tradeoff\n\n**Emerging Folding Schemes:**\nRecent advances in folding schemes represent paradigm shifts in recursive proving:\n\n- **Nova**: Introduces folding for R1CS, enabling incremental computation with minimal per-step overhead (~10K constraints vs. millions for traditional recursion)\n- **SuperNova**: Extends Nova to support multiple circuit types, enabling efficient proving of programs with branching\n- **HyperNova**: Generalizes to customizable constraint systems (CCS), supporting PLONK-style arithmetization\n\nThese schemes directly address the \"proof generation costs\" bottleneck by reducing the marginal cost of proving additional computation steps. While not yet deployed in production rollups, folding schemes are under active development by multiple teams and may fundamentally change prover economics within 12-24 months.\n\n#### 4.1.4 Prover Decentralization and Proof Markets\n\nCurrently, all major ZK-rollups use centralized provers:\n\n```\nTransaction Flow (Current):\nUser → Centralized Sequencer → Centralized Prover → L1 Verification\n\nIdeal Flow:\nUser → Decentralized Sequencer Network → Decentralized Prover Market → L1 Verification\n```\n\n**Cryptographic Requirements for Decentralized Proving:**\nDelegating proof generation to untrusted provers requires solving several cryptographic challenges:\n\n1. **Verifiable Computation Outsourcing**: How does a rollup verify that a delegated prover computed correctly without re-executing? Solutions include:\n   - Requiring provers to stake collateral slashable for invalid proofs\n   - Using commitment schemes where provers commit to intermediate values\n   - Proof-carrying data where the proof itself attests to correct computation\n\n2. **Prover Accountability**: Commitment schemes (polynomial commitments, Merkle trees) enable provers to commit to computation traces, with slashing if the commitment doesn't match the claimed proof\n\n3. **Fair Work Distribution**: Avoiding scenarios where powerful provers capture all work requires careful mechanism design (lottery-based assignment, parallel proving with fastest-wins, etc.)\n\n**Emerging Prover Marketplaces:**\nSeveral projects are building decentralized proving infrastructure:\n\n- **Gevulot**: Decentralized prover network with proof-of-work-style competition\n- **=nil; Foundation's Proof Market**: Marketplace matching proof requests with provers, using cryptographic verification of proof validity\n- **Succinct**: Proving-as-a-service with standardized interfaces\n\nThese marketplaces face the challenge of bootstrapping two-sided networks while maintaining proving quality and latency guarantees.\n\n### 4.2 Sequencer Decentralization\n\nThe sequencer—the entity that orders transactions and produces blocks—represents the most significant centralization point in current rollups.\n\n#### 4.2.1 Current Centralization and Economic Incentives\n\nAll major rollups operate centralized sequencers:\n\n| Rollup | Sequencer Operator | 2023 Sequencer Revenue | Geographic Distribution |\n|--------|-------------------|----------------------|------------------------|\n| Arbitrum One | Offchain Labs | ~$50M+ | Single operator |\n| Base | Coinbase | ~$30M+ | Single operator |\n| OP Mainnet | Optimism Foundation | ~$20M+ | Single operator |\n| zkSync Era | Matter Labs | ~$15M+ | Single operator |\n\n*Revenue estimates based on on-chain fee data; actual figures may vary.*\n\nCentralized sequencers create multiple risk categories:\n\n- **Censorship**: Operators can exclude specific transactions or addresses\n- **MEV extraction**: Operators capture ordering value without competitive redistribution\n- **Liveness**: Single point of failure for transaction inclusion\n- **Regulatory capture**: Identifiable operators subject to legal pressure in their jurisdictions\n\n**The Political Economy of Decentralization:**\nThe substantial revenue generated by centralized sequencers creates strong economic incentives against decentralization. Rollup teams and their investors benefit directly from sequencer profits, creating a principal-agent problem: teams control decentralization timelines while users bear centralization risks.\n\nThis dynamic helps explain why sequencer decentralization has been consistently delayed despite years of promises. Arbitrum's sequencer decentralization was originally targeted for 2023, then 2024, and now has no firm timeline. Similar patterns exist across other major rollups.\n\n#### 4.2.2 Decentralization Approaches\n\nSeveral approaches to sequencer decentralization are under development:\n\n**Leader Rotation:**\nValidators take turns as sequencer based on stake weight or verifiable random selection.\n\n*Technical Challenges:*\n- Latency increases from geographic distribution and leader handoff\n- MEV distribution complexity across rotating leaders\n- Validator set management and stake security\n- Potential for leader extraction during their slot\n\n*Specific Blockers Cited by Teams:*\n- Arbitrum: Concerns about latency impact on user experience; need for robust validator selection mechanism\n- Optimism: Focus on fault proof deployment before sequencer decentralization; coordination across Superchain\n\n**Based Sequencing:**\nEthereum L1 validators/proposers sequence L2 transactions, inheriting L1's decentralization directly. Projects like Taiko are exploring this model.\n\n*Advantages:*\n- Immediate inheritance of L1 decentralization (~900,000 validators)\n- No separate validator set to bootstrap\n- Atomic L1-L2 composability potential\n- Credible neutrality from L1 proposer selection\n\n*Challenges:*\n- Reduced L2 sovereignty (can't implement custom ordering rules)\n- Block time limited to L1 (~12 seconds vs. sub-second L2 blocks)\n- Cross-domain MEV complications where L1 proposers extract L2 value\n- Proposer-builder separation (PBS) interactions add complexity\n\n**Shared Sequencing:**\nMultiple rollups share a decentralized sequencer network (e.g., Espresso Systems, Astria, Radius).\n\n```\nShared Sequencing Architecture:\n\n        ┌─────────────────────┐\n        │   Shared Sequencer  │\n        │      Network        │\n        │  (HotShot/Astria)   │\n        └──────────┬──────────┘\n                   │\n    ┌──────────────┼──────────────┐\n    │              │              │\n    ▼              ▼              ▼\n┌────────┐    ┌────────┐    ┌────────┐\n│Rollup A│    │Rollup B│    │Rollup C│\n│        │    │        │    │        │\n└────────┘    └────────┘    └────────┘\n```\n\n*Advantages:*\n- Atomic cross-rollup transactions possible\n- Shared security across participant rollups\n- Economies of scale for decentralization infrastructure\n\n*Challenges:*\n- Consensus mechanism must provide fast finality (Espresso's HotShot, Astria's CometBFT)\n- Value distribution across rollups and sequencer operators\n- Governance coordination across independent ecosystems\n- Dependency on external infrastructure availability\n\n#### 4.2.3 Game-Theoretic Analysis of Decentralization Delays\n\nWhy haven't decentralization commitments materialized? A game-theoretic perspective reveals structural barriers:\n\n1. **First-Mover Disadvantage**: The first major rollup to decentralize sequencing may experience:\n   - Increased latency relative to competitors\n   - Higher operational complexity\n   - Potential MEV leakage to validators rather than protocol treasury\n   \n2. **Coordination Failure**: No single rollup wants to bear decentralization costs while competitors maintain centralized efficiency advantages\n\n3. **Investor Pressure**: Rollup teams have raised significant venture capital with expectations of returns; sequencer revenue is a primary value capture mechanism\n\n4. **User Indifference**: As demonstrated by Base's growth, users currently don't penalize Stage 0 rollups, reducing competitive pressure to decentralize\n\nBreaking this equilibrium may require:\n- Regulatory pressure mandating decentralization for certain use cases\n- Competitive pressure from new entrants launching with decentralized sequencing\n- Ethereum community norms that stigmatize prolonged centralization\n- Technical breakthroughs reducing decentralization's performance costs\n\n#### 4.2.4 MEV Considerations in Decentralized Sequencing\n\nMEV (Maximal Extractable Value) redistribution is a critical unsolved problem:\n\n**Current State:**\n- Centralized sequencers capture 100% of MEV\n- Some rollups implement MEV-share mechanisms (e.g., Arbitrum's Timeboost)\n- No standardized approach to MEV redistribution\n\n**Proposed Solutions:**\n- *Encrypted mempools*: Transactions encrypted until ordering committed (threshold encryption, delay encryption)\n- *MEV auctions*: Competitive bidding for ordering rights with proceeds distributed\n- *Fair ordering*: First-come-first-served or batch auctions eliminating ordering-based extraction\n- *MEV-burn*: Captured MEV burned or distributed to users\n\nEach approach involves tradeoffs between extraction prevention, latency, complexity, and economic efficiency.\n\n### 4.3 Security Council Governance\n\n#### 4.3.1 The Upgrade Dilemma\n\nRollups face a fundamental tension:\n\n- **Upgradeability enables bug fixes**: Critical vulnerabilities require rapid response capability\n- **Upgradeability enables attacks**: Malicious upgrades can steal all user funds\n\nThis tension is particularly acute for systems securing billions of dollars where both risks are existential.\n\n#### 4.3.2 Security Council Structures: Comparative Analysis\n\nSecurity Councils vary significantly in their design and operation:\n\n**Arbitrum Security Council:**\n- **Composition**: 12 members from diverse ecosystem organizations\n- **Threshold**: 9/12 for emergency actions, 7/12 for non-emergency upgrades\n- **Selection**: Members elected by ARB token holders through on-chain governance\n- **Term Length**: 12-month terms with staggered elections (6 seats every 6 months)\n- **Removal**: Token holders can remove members via governance proposal\n- **Compensation**: Members receive ARB token grants for service\n- **Constraints**: Operates under Arbitrum Constitution defining scope and limitations\n- **Accountability**: Public member identities, election cycles, removal procedures\n- **Geographic Distribution**: Members span multiple jurisdictions to reduce regulatory capture risk\n\n**Optimism Security Council:**\n- **Composition**: 13 members in nested multisig structure\n- **Threshold**: Varies by action type\n- **Selection**: Foundation-appointed with planned transition to elected\n- **Term Length**: Not formally defined; at Foundation discretion\n- **Removal**: Foundation-controlled\n- **Compensation**: Not publicly disclosed\n- **Constraints**: Can pause fault proofs via Guardian role\n- **Accountability**: Less formal accountability framework currently\n- **Relationship to Foundation**: Optimism Foundation maintains significant influence\n\n**zkSync Era Security Council:**\n- **Composition**: Matter Labs-controlled multisig\n- **Threshold**: Not publicly disclosed\n- **Selection**: Company-appointed\n- **Term Length**: Indefinite\n- **Removal**: Company-controlled\n- **Compensation**: Not applicable (employees/affiliates)\n- **Constraints**: No formal constitutional constraints\n- **Accountability**: Limited public accountability mechanisms\n\n**Comparative Assessment:**\n\n| Dimension | Arbitrum | Optimism | zkSync Era |\n|-----------|----------|----------|------------|\n| Member Selection | Elected | Appointed | Company-controlled |\n| Public Identities | Yes | Partial | Limited |\n| Constitutional Constraints | Yes | Developing | No |\n| Emergency Threshold | 9/12 | Variable | Not disclosed |\n| Term Limits | Yes (12 months) | No | No |\n| Removal Mechanism | Token vote | Foundation | None |\n| Compensation Transparency | Yes | No | No |\n\n#### 4.3.3 Governance Token Dynamics and Council Legitimacy\n\nThe democratic legitimacy of elected Security Councils depends critically on governance token distribution and participation:\n\n**ARB Token Concentration:**\n- Top 10 addresses control approximately 40% of ARB supply\n- Offchain Labs and affiliated entities retain significant holdings\n- Voter turnout in Security Council elections has ranged from 5-15% of circulating supply\n\n**Implications for Council Elections:**\n- Concentrated holdings could enable coordinated council capture\n- Low turnout amplifies influence of large holders\n- Delegation patterns create additional concentration (top delegates control disproportionate voting power)\n\n**OP Token Governance:**\n- Optimism's bicameral structure (Token House + Citizens' House) attempts to mitigate plutocratic capture\n- Citizens' House uses non-transferable citizenship for certain decisions\n- Token House still exhibits concentration similar to ARB\n\nThese dynamics raise questions about whether elected councils truly represent user interests or primarily serve large token holders whose incentives may diverge from typical users.\n\n#### 4.3.4 Governance Attack Vectors\n\nSecurity Councils introduce specific attack vectors that Stage 2 would eliminate:\n\n**Social Engineering:**\n- Council members can be individually targeted through phishing, impersonation, or social manipulation\n- Compromise of member keys enables participation in malicious upgrades\n- Mitigation: Hardware security modules, operational security training, key rotation\n\n**Regulatory",
  "manuscript_v3": "# Rollup Stages: Current Landscape, Challenges, and the Path to Full Decentralization\n\n## A Comprehensive Research Report on Layer 2 Scaling Solutions\n\n---\n\n## Executive Summary\n\nRollups have emerged as the dominant paradigm for scaling Ethereum and other Layer 1 blockchains, processing billions of dollars in transactions while inheriting the security guarantees of their underlying networks. However, the journey from centralized sequencers to fully decentralized, trustless systems remains incomplete. This report provides a comprehensive analysis of the rollup maturity framework, examining the current state of major rollup implementations, identifying critical bottlenecks preventing progression to higher stages, and evaluating emerging solutions.\n\nOur analysis reveals that as of early 2025, the vast majority of rollups by Total Value Locked (TVL) remain at Stage 0, with Arbitrum One representing the most advanced major rollup at Stage 1. Stage 2—the highest level of decentralization where users can exit without any trust assumptions beyond L1 security and cryptographic soundness—remains unachieved by any major rollup. Key bottlenecks include incomplete proof system maturity, centralized sequencer architectures, Security Council governance structures with broad upgrade powers, and the absence of robust cross-rollup interoperability with appropriate trust guarantees.\n\nThis report examines these challenges through technical, economic, and governance lenses, providing actionable insights for researchers, developers, and stakeholders invested in the rollup ecosystem's maturation. We conclude that while the technical foundations for Stage 2 rollups exist, achieving this milestone requires coordinated advances in proof systems, decentralized sequencing, governance minimization, and cross-rollup bridging infrastructure over the next 24-48 months.\n\n---\n\n## 1. Introduction\n\n### 1.1 The Scaling Imperative\n\nEthereum's transition to proof-of-stake and the implementation of EIP-4844 (Proto-Danksharding) have established a clear roadmap: the base layer optimizes for security and data availability, while execution scales through Layer 2 solutions. This \"rollup-centric\" roadmap, articulated by Vitalik Buterin in 2020, has fundamentally shaped blockchain architecture.\n\nRollups execute transactions off-chain while posting transaction data (or state differences) to the parent chain, achieving throughput improvements of 10-100x while maintaining security guarantees derived from the underlying Layer 1. As of January 2025, rollups collectively secure over $40 billion in TVL and process more daily transactions than Ethereum mainnet.\n\n### 1.2 The Trust Spectrum\n\nDespite their promise, rollups exist on a spectrum of decentralization and trustlessness. Early implementations required users to trust operators completely—a regression from blockchain's core value proposition. The community recognized this tension, leading to the development of maturity frameworks that track rollups' progression toward full decentralization.\n\n### 1.3 Research Objectives\n\nThis report addresses four primary questions:\n\n1. What constitutes a mature, trustless rollup, and how do we measure progress toward this goal?\n2. What is the current state of major rollup implementations relative to these standards?\n3. What technical, economic, and governance bottlenecks prevent advancement, and what solutions are emerging?\n4. How do cross-rollup interoperability and bridging mechanisms affect the practical security of the rollup ecosystem?\n\n---\n\n## 2. The Rollup Stage Framework\n\n### 2.1 Origins and Rationale\n\nThe rollup stage framework was formalized by L2Beat, the leading Layer 2 analytics platform, in collaboration with the Ethereum research community. The framework emerged from recognition that marketing claims about \"decentralization\" and \"security\" required objective, verifiable criteria.\n\nThe framework defines three stages (0, 1, and 2), each representing increasing levels of trustlessness and decentralization. Critically, the framework focuses on **exit guarantees**—the ability of users to withdraw their funds without relying on any trusted party.\n\n### 2.2 Stage Definitions\n\n#### Stage 0: Full Training Wheels\n\nAt Stage 0, a rollup has deployed on mainnet but retains significant centralized control. The defining characteristics include:\n\n- **Centralized sequencing**: A single operator orders and executes transactions\n- **Upgradeable contracts**: The rollup's smart contracts can be modified without delay or with minimal timelock\n- **No fraud/validity proofs**: Users cannot independently verify state transitions, or proofs exist but can be overridden\n- **Operator-dependent exits**: Users rely on the operator to process withdrawals\n\nStage 0 rollups are functionally similar to sidechains with additional data availability guarantees. Users must trust that operators will not censor transactions, steal funds through malicious upgrades, or abandon the network.\n\n#### Stage 1: Limited Training Wheels\n\nStage 1 represents meaningful progress toward trustlessness:\n\n- **Functional proof system**: Either fraud proofs (optimistic rollups) or validity proofs (ZK-rollups) are deployed and operational\n- **Permissionless verification**: Anyone can submit fraud proofs or verify validity proofs\n- **Escape hatch mechanism**: Users can force withdrawals through the L1 if the operator becomes unresponsive\n- **Security Council**: A multisig can intervene in case of bugs, but with significant constraints (typically requiring supermajority threshold)\n\nThe key advancement at Stage 1 is that **users can exit without operator cooperation**, though they may still need to trust a Security Council for bug fixes during an interim period.\n\n#### Stage 2: No Training Wheels\n\nStage 2 represents full trustlessness:\n\n- **Immutable or governance-minimized contracts**: Upgrades require extended timelocks (30+ days) or are impossible\n- **No Security Council override**: Or the council can only act after the timelock expires, giving users time to exit\n- **Battle-tested proof system**: The proof mechanism has been operational without critical failures for an extended period\n- **Decentralized sequencing**: Multiple parties can propose blocks, eliminating single points of failure (or users can self-sequence via L1)\n\nAt Stage 2, the rollup inherits Ethereum's security guarantees fully. Users need only trust the L1 consensus and the mathematical soundness of the proof system.\n\n### 2.3 Framework Limitations and Ongoing Debates\n\nThe stage framework, while valuable, has acknowledged limitations:\n\n1. **Binary categorization**: Rollups may meet some but not all criteria for a stage, creating edge cases where classification is contested\n2. **Implementation nuance**: Two Stage 1 rollups may have significantly different security properties depending on Security Council structure, proof system maturity, and escape hatch robustness\n3. **Dynamic assessment**: A rollup's stage can regress if vulnerabilities are discovered or if governance decisions weaken security guarantees\n4. **Scope limitations**: The framework doesn't directly assess liveness, MEV extraction, economic security, or cross-rollup bridging trust assumptions\n5. **Classification disputes**: Stage classifications are sometimes contested by rollup teams or community members who interpret criteria differently; readers should consult L2Beat directly for current classifications and understand the methodology behind disputed assessments\n\n---\n\n## 3. Current Landscape Analysis\n\n### 3.1 Market Overview\n\nAs of January 2025, the rollup ecosystem comprises over 50 active networks with combined TVL exceeding $40 billion. The market is dominated by a small number of major players:\n\n| Rollup | Type | TVL (USD) | Stage | Launch Date |\n|--------|------|-----------|-------|-------------|\n| Arbitrum One | Optimistic | ~$15B | 1 | August 2021 |\n| Base | Optimistic | ~$12B | 0 | August 2023 |\n| OP Mainnet | Optimistic | ~$7B | 0 | December 2021 |\n| zkSync Era | ZK | ~$1B | 0 | March 2023 |\n| Starknet | ZK | ~$500M | 0 | November 2022 |\n| Linea | ZK | ~$800M | 0 | July 2023 |\n| Scroll | ZK | ~$600M | 0 | October 2023 |\n\n*Data approximate as of January 2025. Stage classifications per L2Beat methodology and subject to change. Readers should verify current status at l2beat.com.*\n\n### 3.2 Optimistic Rollups: Detailed Assessment\n\n#### 3.2.1 Arbitrum One\n\nArbitrum One, developed by Offchain Labs, represents the most mature optimistic rollup implementation. Key characteristics:\n\n**Stage 1 Qualifications:**\n- Deployed BOLD (Bounded Liquidity Delay) fraud proof system in late 2024\n- Permissionless validation enabled—anyone can challenge invalid state roots\n- Functional escape hatch through `forceInclusion` mechanism allowing users to submit transactions directly to L1\n- 6 day, 8 hour challenge period for fraud proofs\n\n**Remaining Limitations:**\n- Security Council (12-member multisig) can upgrade contracts with a 3-day delay for non-emergency actions\n- Emergency upgrades require 9/12 threshold but can bypass timelock\n- Sequencer remains centralized (operated by Offchain Labs)\n- Council can pause the system in emergencies\n\nThe Security Council's powers represent the primary barrier to Stage 2. While the council provides important bug-fix capabilities, its ability to execute emergency upgrades creates trust assumptions that Stage 2 would eliminate.\n\n#### 3.2.2 Optimism (OP Mainnet)\n\nOP Mainnet, the flagship chain of the OP Stack, has made significant progress but remains at Stage 0:\n\n**Current State:**\n- Fault proof system (FPAC - Fault Proof Alpha Cannon) launched in June 2024\n- Permissionless proposers enabled\n- 7-day challenge window\n\n**Stage 0 Classification Rationale:**\n- Guardian role can disable fault proofs entirely, reverting to permissioned output proposals\n- Deputy Guardian can pause withdrawals\n- Security Council can upgrade without delay in emergency situations\n- Proof system relatively new, requiring more battle-testing before governance constraints can be safely reduced\n\nThe OP Stack's modular design means improvements benefit the entire Superchain ecosystem (Base, Mode, Zora, etc.), but this also means vulnerabilities affect multiple networks simultaneously—a systemic risk consideration.\n\n#### 3.2.3 Base\n\nBase, developed by Coinbase, is the largest Stage 0 rollup by TVL:\n\n**Current Limitations:**\n- Inherits OP Stack limitations including Guardian override capabilities\n- Additional Coinbase operational dependencies\n- Relies on Optimism's Security Council rather than independent governance\n- Sequencer operated by Coinbase with no current decentralization timeline\n\nBase's rapid growth ($12B+ TVL) despite Stage 0 status highlights that users currently prioritize other factors (UX, ecosystem, institutional backing, regulatory clarity) over decentralization metrics—a finding with implications for the pace of ecosystem-wide decentralization.\n\n### 3.3 ZK-Rollups: Detailed Assessment\n\n#### 3.3.1 zkSync Era\n\nzkSync Era, developed by Matter Labs, is the largest ZK-rollup by TVL:\n\n**Technical Architecture:**\n- Uses a customized PLONK-based proof system (specifically a variant with custom gates and lookup arguments)\n- Boojum prover utilizing FRI-based polynomial commitments for improved efficiency\n- EVM-equivalent execution environment via zkEVM\n\n**Stage 0 Limitations:**\n- Validity proofs cover state transitions but the system retains centralized override capabilities\n- Centralized sequencer and prover operated by Matter Labs\n- Upgradeable contracts with Security Council control\n- Escape hatch mechanism exists but has not been battle-tested in adversarial conditions\n\n#### 3.3.2 Starknet\n\nStarknet, developed by StarkWare, uses STARK proofs:\n\n**Technical Characteristics:**\n- Cairo VM (not EVM-equivalent, requiring contract rewriting or transpilation)\n- Recursive proofs for scalability via SHARP (Shared Prover)\n- FRI-based polynomial commitments providing post-quantum security assumptions\n\n**Current Limitations:**\n- Centralized sequencer operated by StarkWare\n- Upgradeable contracts with multisig control\n- Escape hatch exists but requires specific conditions and has operational complexity\n- Governance transitioning toward decentralization but not yet complete\n\n#### 3.3.3 Scroll and Linea\n\nBoth represent newer zkEVM implementations:\n\n**Scroll:**\n- Type 2 zkEVM (EVM-equivalent at bytecode level)\n- Uses a combination of KZG commitments and custom proving system\n- Decentralized prover network in development\n- Currently centralized sequencing and proving with roadmap toward decentralization\n\n**Linea:**\n- Developed by Consensys\n- Type 2 zkEVM with Lattice-based proof system\n- Centralized operations with published decentralization roadmap\n- Benefits from Consensys infrastructure but inherits single-operator risks\n\n### 3.4 Comparative Analysis\n\n```\nDecentralization Spectrum (January 2025)\n\nStage 2: [None]\n         |\nStage 1: [Arbitrum One]\n         |\nStage 0: [Base, OP Mainnet, zkSync Era, Starknet, Scroll, Linea, ...]\n         |\nCentralized: [Various app-specific rollups, new launches]\n```\n\nThe clustering at Stage 0 reflects both the technical difficulty of advancement and the recency of many implementations. Notably, the transition from Stage 0 to Stage 1 requires not just technical implementation but sufficient operational history to justify reduced governance intervention capabilities.\n\n---\n\n## 4. Critical Bottlenecks\n\n### 4.1 Proof System Maturity\n\n#### 4.1.1 Optimistic Rollup Challenges\n\nFraud proof systems face several fundamental challenges:\n\n**Complexity of Dispute Resolution:**\nThe fraud proof game requires proving that a specific instruction in a potentially billions-long execution trace was computed incorrectly. This involves:\n\n1. Interactive bisection to identify the disputed instruction\n2. One-step proof execution on L1\n3. Handling of edge cases (memory access, precompiles, cross-contract calls, etc.)\n\nArbitrum's BOLD protocol addresses the \"delay attack\" vulnerability where malicious actors could indefinitely postpone fraud proof resolution by posting multiple invalid claims. BOLD bounds the maximum delay regardless of attacker resources, but introduces its own complexity and capital requirements for defenders.\n\n**The Verifier's Dilemma:**\nRational validators may not monitor for fraud if the expected cost exceeds the expected reward. This creates scenarios where fraud could go unchallenged during periods of:\n- Low attention (holidays, competing events)\n- High gas prices making challenges expensive\n- Coordination failures among potential challengers\n\nResearch by Thibault et al. (2024) formalizes this dilemma and proposes mechanism design solutions, but production implementations remain limited.\n\n#### 4.1.2 ZK-Rollup Challenges\n\nZK-rollups face different but equally significant challenges:\n\n**Proof Generation Costs and Batched Economics:**\nGenerating validity proofs remains computationally expensive. Critically, ZK-rollups do not prove individual transactions but rather batches of thousands of transactions, amortizing proving costs across the batch. The relevant metrics are therefore proving throughput and batch finalization latency rather than per-transaction costs:\n\n| Proof System | Proof Size | Proving Throughput | Batch Size | L1 Verification Cost | Trusted Setup |\n|--------------|------------|-------------------|------------|---------------------|---------------|\n| Groth16 | ~200 bytes | ~1-5 TPS | 1000-5000 tx | ~230K gas | Required (circuit-specific) |\n| PLONK (KZG) | ~400 bytes | ~5-15 TPS | 1000-10000 tx | ~300K gas | Required (universal) |\n| STARKs (FRI) | ~50-200 KB | ~10-50 TPS | 5000-20000 tx | ~1-5M gas | None |\n| Halo2 (IPA) | ~5 KB | ~2-10 TPS | 1000-5000 tx | ~500K gas | None |\n\n*Throughput figures reflect current production implementations with GPU acceleration. Actual performance varies significantly based on circuit complexity, hardware, and optimization level.*\n\nFor context, zkSync Era's Boojum prover achieves approximately 10 TPS proving throughput through parallelization and GPU acceleration. Scroll's proving pipeline separates EVM trace generation from constraint satisfaction, enabling different optimization strategies for each phase.\n\n**Hardware Acceleration and Prover Infrastructure:**\nCurrent proving infrastructure relies heavily on hardware acceleration:\n\n- **GPU Proving**: Most production provers use CUDA-optimized implementations, achieving 10-100x speedups over CPU proving\n- **FPGA Development**: Several teams (Ingonyama, Cysic) are developing FPGA-based provers for improved efficiency\n- **ASIC Prospects**: Purpose-built proving ASICs could provide further order-of-magnitude improvements but require significant capital investment and introduce centralization concerns\n\nThe capital requirements for competitive proving infrastructure create natural centralization pressure, as only well-resourced operators can afford state-of-the-art hardware.\n\n**Circuit Completeness and Soundness:**\nZK circuits must correctly encode all EVM opcodes and edge cases. The audit surface is enormous:\n\n- Compiler correctness (high-level language to circuit constraints)\n- Constraint system completeness (all execution paths properly constrained)\n- Prover implementation (no bugs allowing false proofs)\n- Verifier implementation (no bugs accepting invalid proofs)\n\nBugs in circuit design can lead to:\n- Invalid state transitions being accepted (soundness failure)\n- Valid transactions being rejected (completeness failure)\n- Exploitable vulnerabilities allowing fund theft\n\n**Cryptographic Security Assumptions:**\nDifferent proof systems rely on different cryptographic assumptions with varying confidence levels:\n\n| Assumption | Proof Systems | Post-Quantum | Confidence | Notes |\n|------------|---------------|--------------|------------|-------|\n| Discrete Log (Elliptic Curves) | Groth16, PLONK (KZG) | No | High | Well-studied, decades of cryptanalysis |\n| Random Oracle Model | Most systems | Varies | High | Standard model alternative exists for some |\n| Algebraic Group Model | PLONK, Groth16 | No | Medium-High | Relatively newer assumption |\n| Collision-Resistant Hashing | STARKs | Yes | Very High | Minimal assumptions |\n| Knowledge of Exponent (KEA) | Groth16 | No | Medium | Non-falsifiable assumption; genuine long-term concern |\n\nThe Knowledge of Exponent assumption underlying Groth16 deserves particular attention: it is non-falsifiable (cannot be proven false even if incorrect), representing a qualitatively different security foundation than falsifiable assumptions. This motivates the industry trend toward PLONK-based systems with universal trusted setups.\n\n**Trusted Setup Considerations:**\nThe trusted setup burden varies significantly:\n\n- **Circuit-specific setups (Groth16)**: Each circuit requires a new ceremony; compromise of any ceremony's toxic waste enables proof forgery\n- **Universal setups (PLONK with KZG)**: A single ceremony (e.g., Aztec's Ignition with 176 participants, Zcash's Powers of Tau) can be reused across all circuits, dramatically reducing practical burden\n- **Transparent setups (STARKs, Halo2 with IPA)**: No trusted setup required; security relies only on hash function collision resistance\n\n#### 4.1.3 Recursive Proofs and Proof Aggregation\n\nA critical area omitted from many rollup analyses is the role of recursive proof composition in addressing scalability bottlenecks:\n\n**Recursive Proof Fundamentals:**\nRecursive proofs allow a proof to verify other proofs, enabling:\n- Proof aggregation: Multiple transaction batch proofs combined into a single proof\n- Incremental verification: Proving correctness of computation that includes previous proof verification\n- Compression: Reducing L1 verification costs by posting a single proof for many batches\n\n**Production Implementations:**\n\n*Starknet's SHARP (Shared Prover):*\nSHARP aggregates proofs from multiple applications (Starknet, StarkEx-based systems) into recursive proof trees, amortizing L1 verification costs across all participants. A single L1 proof can attest to millions of transactions across multiple applications.\n\n*Polygon zkEVM's STARK-to-SNARK Wrapping:*\nPolygon zkEVM generates STARK proofs for execution (benefiting from no trusted setup and post-quantum security) then proves STARK verification inside a SNARK circuit for L1 submission. This provides:\n- STARK security properties for execution proving\n- SNARK efficiency (~230K gas) for L1 verification\n- Practical solution to the proof size vs. verification cost tradeoff\n\n**Emerging Folding Schemes:**\nRecent advances in folding schemes represent paradigm shifts in recursive proving:\n\n- **Nova**: Introduces folding for R1CS, enabling incremental computation with minimal per-step overhead (~10K constraints vs. millions for traditional recursion)\n- **SuperNova**: Extends Nova to support multiple circuit types, enabling efficient proving of programs with branching\n- **HyperNova**: Generalizes to customizable constraint systems (CCS), supporting PLONK-style arithmetization\n\nThese schemes directly address the \"proof generation costs\" bottleneck by reducing the marginal cost of proving additional computation steps. While not yet deployed in production rollups, folding schemes are under active development by multiple teams and may fundamentally change prover economics within 12-24 months.\n\n#### 4.1.4 Prover Decentralization and Proof Markets\n\nCurrently, all major ZK-rollups use centralized provers:\n\n```\nTransaction Flow (Current):\nUser → Centralized Sequencer → Centralized Prover → L1 Verification\n\nIdeal Flow:\nUser → Decentralized Sequencer Network → Decentralized Prover Market → L1 Verification\n```\n\n**Cryptographic Requirements for Decentralized Proving:**\nDelegating proof generation to untrusted provers requires solving several cryptographic challenges:\n\n1. **Verifiable Computation Outsourcing**: How does a rollup verify that a delegated prover computed correctly without re-executing? Solutions include:\n   - Requiring provers to stake collateral slashable for invalid proofs\n   - Using commitment schemes where provers commit to intermediate values\n   - Proof-carrying data where the proof itself attests to correct computation\n\n2. **Prover Accountability**: Commitment schemes (polynomial commitments, Merkle trees) enable provers to commit to computation traces, with slashing if the commitment doesn't match the claimed proof\n\n3. **Fair Work Distribution**: Avoiding scenarios where powerful provers capture all work requires careful mechanism design (lottery-based assignment, parallel proving with fastest-wins, etc.)\n\n**Emerging Prover Marketplaces:**\nSeveral projects are building decentralized proving infrastructure:\n\n- **Gevulot**: Decentralized prover network with proof-of-work-style competition\n- **=nil; Foundation's Proof Market**: Marketplace matching proof requests with provers, using cryptographic verification of proof validity\n- **Succinct**: Proving-as-a-service with standardized interfaces\n\nThese marketplaces face the challenge of bootstrapping two-sided networks while maintaining proving quality and latency guarantees.\n\n### 4.2 Sequencer Decentralization\n\nThe sequencer—the entity that orders transactions and produces blocks—represents the most significant centralization point in current rollups.\n\n#### 4.2.1 Current Centralization and Economic Incentives\n\nAll major rollups operate centralized sequencers:\n\n| Rollup | Sequencer Operator | 2023 Sequencer Revenue | Geographic Distribution |\n|--------|-------------------|----------------------|------------------------|\n| Arbitrum One | Offchain Labs | ~$50M+ | Single operator |\n| Base | Coinbase | ~$30M+ | Single operator |\n| OP Mainnet | Optimism Foundation | ~$20M+ | Single operator |\n| zkSync Era | Matter Labs | ~$15M+ | Single operator |\n\n*Revenue estimates based on on-chain fee data; actual figures may vary.*\n\nCentralized sequencers create multiple risk categories:\n\n- **Censorship**: Operators can exclude specific transactions or addresses\n- **MEV extraction**: Operators capture ordering value without competitive redistribution\n- **Liveness**: Single point of failure for transaction inclusion\n- **Regulatory capture**: Identifiable operators subject to legal pressure in their jurisdictions\n\n**The Political Economy of Decentralization:**\nThe substantial revenue generated by centralized sequencers creates strong economic incentives against decentralization. Rollup teams and their investors benefit directly from sequencer profits, creating a principal-agent problem: teams control decentralization timelines while users bear centralization risks.\n\nThis dynamic helps explain why sequencer decentralization has been consistently delayed despite years of promises. Arbitrum's sequencer decentralization was originally targeted for 2023, then 2024, and now has no firm timeline. Similar patterns exist across other major rollups.\n\n#### 4.2.2 Decentralization Approaches\n\nSeveral approaches to sequencer decentralization are under development:\n\n**Leader Rotation:**\nValidators take turns as sequencer based on stake weight or verifiable random selection.\n\n*Technical Challenges:*\n- Latency increases from geographic distribution and leader handoff\n- MEV distribution complexity across rotating leaders\n- Validator set management and stake security\n- Potential for leader extraction during their slot\n\n*Specific Blockers Cited by Teams:*\n- Arbitrum: Concerns about latency impact on user experience; need for robust validator selection mechanism\n- Optimism: Focus on fault proof deployment before sequencer decentralization; coordination across Superchain\n\n**Based Sequencing:**\nEthereum L1 validators/proposers sequence L2 transactions, inheriting L1's decentralization directly. Projects like Taiko are exploring this model.\n\n*Advantages:*\n- Immediate inheritance of L1 decentralization (~900,000 validators)\n- No separate validator set to bootstrap\n- Atomic L1-L2 composability potential\n- Credible neutrality from L1 proposer selection\n\n*Challenges:*\n- Reduced L2 sovereignty (can't implement custom ordering rules)\n- Block time limited to L1 (~12 seconds vs. sub-second L2 blocks)\n- Cross-domain MEV complications where L1 proposers extract L2 value\n- Proposer-builder separation (PBS) interactions add complexity\n\n**Shared Sequencing:**\nMultiple rollups share a decentralized sequencer network (e.g., Espresso Systems, Astria, Radius).\n\n```\nShared Sequencing Architecture:\n\n        ┌─────────────────────┐\n        │   Shared Sequencer  │\n        │      Network        │\n        │  (HotShot/Astria)   │\n        └──────────┬──────────┘\n                   │\n    ┌──────────────┼──────────────┐\n    │              │              │\n    ▼              ▼              ▼\n┌────────┐    ┌────────┐    ┌────────┐\n│Rollup A│    │Rollup B│    │Rollup C│\n│        │    │        │    │        │\n└────────┘    └────────┘    └────────┘\n```\n\n*Advantages:*\n- Atomic cross-rollup transactions possible\n- Shared security across participant rollups\n- Economies of scale for decentralization infrastructure\n\n*Challenges:*\n- Consensus mechanism must provide fast finality (Espresso's HotShot, Astria's CometBFT)\n- Value distribution across rollups and sequencer operators\n- Governance coordination across independent ecosystems\n- Dependency on external infrastructure availability\n\n#### 4.2.3 Game-Theoretic Analysis of Decentralization Delays\n\nWhy haven't decentralization commitments materialized? A game-theoretic perspective reveals structural barriers:\n\n1. **First-Mover Disadvantage**: The first major rollup to decentralize sequencing may experience:\n   - Increased latency relative to competitors\n   - Higher operational complexity\n   - Potential MEV leakage to validators rather than protocol treasury\n   \n2. **Coordination Failure**: No single rollup wants to bear decentralization costs while competitors maintain centralized efficiency advantages\n\n3. **Investor Pressure**: Rollup teams have raised significant venture capital with expectations of returns; sequencer revenue is a primary value capture mechanism\n\n4. **User Indifference**: As demonstrated by Base's growth, users currently don't penalize Stage 0 rollups, reducing competitive pressure to decentralize\n\nBreaking this equilibrium may require:\n- Regulatory pressure mandating decentralization for certain use cases\n- Competitive pressure from new entrants launching with decentralized sequencing\n- Ethereum community norms that stigmatize prolonged centralization\n- Technical breakthroughs reducing decentralization's performance costs\n\n#### 4.2.4 MEV Considerations in Decentralized Sequencing\n\nMEV (Maximal Extractable Value) redistribution is a critical unsolved problem:\n\n**Current State:**\n- Centralized sequencers capture 100% of MEV\n- Some rollups implement MEV-share mechanisms (e.g., Arbitrum's Timeboost)\n- No standardized approach to MEV redistribution\n\n**Proposed Solutions:**\n- *Encrypted mempools*: Transactions encrypted until ordering committed (threshold encryption, delay encryption)\n- *MEV auctions*: Competitive bidding for ordering rights with proceeds distributed\n- *Fair ordering*: First-come-first-served or batch auctions eliminating ordering-based extraction\n- *MEV-burn*: Captured MEV burned or distributed to users\n\nEach approach involves tradeoffs between extraction prevention, latency, complexity, and economic efficiency.\n\n### 4.3 Security Council Governance\n\n#### 4.3.1 The Upgrade Dilemma\n\nRollups face a fundamental tension:\n\n- **Upgradeability enables bug fixes**: Critical vulnerabilities require rapid response capability\n- **Upgradeability enables attacks**: Malicious upgrades can steal all user funds\n\nThis tension is particularly acute for systems securing billions of dollars where both risks are existential.\n\n#### 4.3.2 Security Council Structures: Comparative Analysis\n\nSecurity Councils vary significantly in their design and operation:\n\n**Arbitrum Security Council:**\n- **Composition**: 12 members from diverse ecosystem organizations\n- **Threshold**: 9/12 for emergency actions, 7/12 for non-emergency upgrades\n- **Selection**: Members elected by ARB token holders through on-chain governance\n- **Term Length**: 12-month terms with staggered elections (6 seats every 6 months)\n- **Removal**: Token holders can remove members via governance proposal\n- **Compensation**: Members receive ARB token grants for service\n- **Constraints**: Operates under Arbitrum Constitution defining scope and limitations\n- **Accountability**: Public member identities, election cycles, removal procedures\n- **Geographic Distribution**: Members span multiple jurisdictions to reduce regulatory capture risk\n\n**Optimism Security Council:**\n- **Composition**: 13 members in nested multisig structure\n- **Threshold**: Varies by action type\n- **Selection**: Foundation-appointed with planned transition to elected\n- **Term Length**: Not formally defined; at Foundation discretion\n- **Removal**: Foundation-controlled\n- **Compensation**: Not publicly disclosed\n- **Constraints**: Can pause fault proofs via Guardian role\n- **Accountability**: Less formal accountability framework currently\n- **Relationship to Foundation**: Optimism Foundation maintains significant influence\n\n**zkSync Era Security Council:**\n- **Composition**: Matter Labs-controlled multisig\n- **Threshold**: Not publicly disclosed\n- **Selection**: Company-appointed\n- **Term Length**: Indefinite\n- **Removal**: Company-controlled\n- **Compensation**: Not applicable (employees/affiliates)\n- **Constraints**: No formal constitutional constraints\n- **Accountability**: Limited public accountability mechanisms\n\n**Comparative Assessment:**\n\n| Dimension | Arbitrum | Optimism | zkSync Era |\n|-----------|----------|----------|------------|\n| Member Selection | Elected | Appointed | Company-controlled |\n| Public Identities | Yes | Partial | Limited |\n| Constitutional Constraints | Yes | Developing | No |\n| Emergency Threshold | 9/12 | Variable | Not disclosed |\n| Term Limits | Yes (12 months) | No | No |\n| Removal Mechanism | Token vote | Foundation | None |\n| Compensation Transparency | Yes | No | No |\n\n#### 4.3.3 Governance Token Dynamics and Council Legitimacy\n\nThe democratic legitimacy of elected Security Councils depends critically on governance token distribution and participation:\n\n**ARB Token Concentration:**\n- Top 10 addresses control approximately 40% of ARB supply\n- Offchain Labs and affiliated entities retain significant holdings\n- Voter turnout in Security Council elections has ranged from 5-15% of circulating supply\n\n**Implications for Council Elections:**\n- Concentrated holdings could enable coordinated council capture\n- Low turnout amplifies influence of large holders\n- Delegation patterns create additional concentration (top delegates control disproportionate voting power)\n\n**OP Token Governance:**\n- Optimism's bicameral structure (Token House + Citizens' House) attempts to mitigate plutocratic capture\n- Citizens' House uses non-transferable citizenship for certain decisions\n- Token House still exhibits concentration similar to ARB\n\nThese dynamics raise questions about whether elected councils truly represent user interests or primarily serve large token holders whose incentives may diverge from typical users.\n\n#### 4.3.4 Governance Attack Vectors\n\nSecurity Councils introduce specific attack vectors that Stage 2 would eliminate:\n\n**Social Engineering:**\n- Council members can be individually targeted through phishing, impersonation, or social manipulation\n- Compromise of member keys enables participation in malicious upgrades\n- Mitigation: Hardware security modules, operational security training, key rotation\n\n**Regulatory",
  "manuscript_v1": "# Rollup Stages: Current Landscape, Challenges, and the Path to Full Decentralization\n\n## A Comprehensive Research Report on Layer 2 Scaling Solutions\n\n---\n\n## Executive Summary\n\nRollups have emerged as the dominant paradigm for scaling Ethereum and other Layer 1 blockchains, processing billions of dollars in transactions while inheriting the security guarantees of their underlying networks. However, the journey from centralized sequencers to fully decentralized, trustless systems remains incomplete. This report provides a comprehensive analysis of the rollup maturity framework, examining the current state of major rollup implementations, identifying critical bottlenecks preventing progression to higher stages, and evaluating emerging solutions.\n\nOur analysis reveals that as of early 2025, no major rollup has achieved Stage 2 status—the highest level of decentralization where users can exit without any trust assumptions. The majority of rollups by Total Value Locked (TVL) remain at Stage 0 or Stage 1, with significant technical and governance challenges impeding advancement. Key bottlenecks include the absence of fraud-proof mechanisms in optimistic rollups, incomplete validity proof coverage in ZK-rollups, centralized sequencer architectures, and the persistence of upgradeable contracts with short timelocks.\n\nThis report examines these challenges through technical, economic, and governance lenses, providing actionable insights for researchers, developers, and stakeholders invested in the rollup ecosystem's maturation. We conclude that while the technical foundations for Stage 2 rollups exist, achieving this milestone requires coordinated advances in proof systems, decentralized sequencing, and governance mechanisms over the next 18-36 months.\n\n---\n\n## 1. Introduction\n\n### 1.1 The Scaling Imperative\n\nEthereum's transition to proof-of-stake and the implementation of EIP-4844 (Proto-Danksharding) have established a clear roadmap: the base layer optimizes for security and data availability, while execution scales through Layer 2 solutions. This \"rollup-centric\" roadmap, articulated by Vitalik Buterin in 2020, has fundamentally shaped blockchain architecture.\n\nRollups execute transactions off-chain while posting transaction data (or state differences) to the parent chain, achieving throughput improvements of 10-100x while maintaining security guarantees derived from the underlying Layer 1. As of January 2025, rollups collectively secure over $40 billion in TVL and process more daily transactions than Ethereum mainnet.\n\n### 1.2 The Trust Spectrum\n\nDespite their promise, rollups exist on a spectrum of decentralization and trustlessness. Early implementations required users to trust operators completely—a regression from blockchain's core value proposition. The community recognized this tension, leading to the development of maturity frameworks that track rollups' progression toward full decentralization.\n\n### 1.3 Research Objectives\n\nThis report addresses three primary questions:\n\n1. What constitutes a mature, trustless rollup, and how do we measure progress toward this goal?\n2. What is the current state of major rollup implementations relative to these standards?\n3. What technical, economic, and governance bottlenecks prevent advancement, and what solutions are emerging?\n\n---\n\n## 2. The Rollup Stage Framework\n\n### 2.1 Origins and Rationale\n\nThe rollup stage framework was formalized by L2Beat, the leading Layer 2 analytics platform, in collaboration with the Ethereum research community. The framework emerged from recognition that marketing claims about \"decentralization\" and \"security\" required objective, verifiable criteria.\n\nThe framework defines three stages (0, 1, and 2), each representing increasing levels of trustlessness and decentralization. Critically, the framework focuses on **exit guarantees**—the ability of users to withdraw their funds without relying on any trusted party.\n\n### 2.2 Stage Definitions\n\n#### Stage 0: Full Training Wheels\n\nAt Stage 0, a rollup has deployed on mainnet but retains significant centralized control. The defining characteristics include:\n\n- **Centralized sequencing**: A single operator orders and executes transactions\n- **Upgradeable contracts**: The rollup's smart contracts can be modified without delay or with minimal timelock\n- **No fraud/validity proofs**: Users cannot independently verify state transitions\n- **Operator-dependent exits**: Users rely on the operator to process withdrawals\n\nStage 0 rollups are functionally similar to sidechains with additional data availability guarantees. Users must trust that operators will not censor transactions, steal funds through malicious upgrades, or abandon the network.\n\n#### Stage 1: Limited Training Wheels\n\nStage 1 represents meaningful progress toward trustlessness:\n\n- **Functional proof system**: Either fraud proofs (optimistic rollups) or validity proofs (ZK-rollups) are deployed and operational\n- **Permissionless verification**: Anyone can submit fraud proofs or verify validity proofs\n- **Escape hatch mechanism**: Users can force withdrawals through the L1 if the operator becomes unresponsive\n- **Security Council**: A multisig can intervene in case of bugs, but with significant constraints\n\nThe key advancement at Stage 1 is that **users can exit without operator cooperation**, though they may still need to trust a Security Council for bug fixes.\n\n#### Stage 2: No Training Wheels\n\nStage 2 represents full trustlessness:\n\n- **Immutable or governance-minimized contracts**: Upgrades require extended timelocks (30+ days) or are impossible\n- **No Security Council override**: Or the council can only act after the timelock expires\n- **Battle-tested proof system**: The proof mechanism has been operational without critical failures for an extended period\n- **Decentralized sequencing**: Multiple parties can propose blocks, eliminating single points of failure\n\nAt Stage 2, the rollup inherits Ethereum's security guarantees fully. Users need only trust the L1 consensus and the mathematical soundness of the proof system.\n\n### 2.3 Framework Limitations\n\nThe stage framework, while valuable, has acknowledged limitations:\n\n1. **Binary categorization**: Rollups may meet some but not all criteria for a stage\n2. **Implementation nuance**: Two Stage 1 rollups may have significantly different security properties\n3. **Dynamic assessment**: A rollup's stage can regress if vulnerabilities are discovered\n4. **Scope limitations**: The framework doesn't assess liveness, MEV, or economic security\n\n---\n\n## 3. Current Landscape Analysis\n\n### 3.1 Market Overview\n\nAs of January 2025, the rollup ecosystem comprises over 50 active networks with combined TVL exceeding $40 billion. The market is dominated by a small number of major players:\n\n| Rollup | Type | TVL (USD) | Stage | Launch Date |\n|--------|------|-----------|-------|-------------|\n| Arbitrum One | Optimistic | ~$15B | 1 | August 2021 |\n| Base | Optimistic | ~$12B | 0 | August 2023 |\n| OP Mainnet | Optimistic | ~$7B | 0 | December 2021 |\n| zkSync Era | ZK | ~$1B | 0 | March 2023 |\n| Starknet | ZK | ~$500M | 0 | November 2022 |\n| Linea | ZK | ~$800M | 0 | July 2023 |\n| Scroll | ZK | ~$600M | 0 | October 2023 |\n\n*Data approximate as of January 2025*\n\n### 3.2 Optimistic Rollups: Detailed Assessment\n\n#### 3.2.1 Arbitrum One\n\nArbitrum One, developed by Offchain Labs, represents the most mature optimistic rollup implementation. Key characteristics:\n\n**Stage 1 Qualifications:**\n- Deployed BOLD (Bounded Liquidity Delay) fraud proof system in late 2024\n- Permissionless validation enabled\n- Functional escape hatch through `forceInclusion` mechanism\n- 8-day challenge period for fraud proofs\n\n**Remaining Limitations:**\n- Security Council (12-member multisig) can upgrade contracts with only a 12-hour delay\n- Sequencer remains centralized (operated by Offchain Labs)\n- Council can pause the system and override fraud proofs\n\nThe Security Council's powers represent the primary barrier to Stage 2. While the council provides important bug-fix capabilities, its ability to upgrade contracts rapidly creates trust assumptions.\n\n#### 3.2.2 Optimism (OP Mainnet)\n\nOP Mainnet, the flagship chain of the OP Stack, has made significant progress but remains at Stage 0:\n\n**Current State:**\n- Fault proof system launched in June 2024\n- Permissionless proposers enabled\n- 7-day challenge window\n\n**Stage 0 Classification Rationale:**\n- Guardian role can disable fault proofs entirely\n- Security Council can upgrade without delay in emergency\n- Proof system relatively new, requiring more battle-testing\n\nThe OP Stack's modular design means improvements benefit the entire Superchain ecosystem (Base, Mode, Zora, etc.), but this also means vulnerabilities affect multiple networks simultaneously.\n\n#### 3.2.3 Base\n\nBase, developed by Coinbase, is the largest Stage 0 rollup by TVL:\n\n**Current Limitations:**\n- Inherits OP Stack limitations\n- Additional Coinbase operational dependencies\n- No independent Security Council (relies on Optimism's)\n\nBase's rapid growth ($12B+ TVL) despite Stage 0 status highlights that users currently prioritize other factors (UX, ecosystem, institutional backing) over decentralization metrics.\n\n### 3.3 ZK-Rollups: Detailed Assessment\n\n#### 3.3.1 zkSync Era\n\nzkSync Era, developed by Matter Labs, is the largest ZK-rollup by TVL:\n\n**Technical Architecture:**\n- Uses PLONK-based proof system\n- Boojum prover for improved efficiency\n- EVM-equivalent execution environment\n\n**Stage 0 Limitations:**\n- Validity proofs only cover state transitions, not data availability\n- Centralized sequencer and prover\n- Upgradeable contracts with 21-day timelock (insufficient for Stage 1)\n- No escape hatch mechanism currently functional\n\n#### 3.3.2 Starknet\n\nStarknet, developed by StarkWare, uses STARK proofs:\n\n**Technical Characteristics:**\n- Cairo VM (not EVM-equivalent)\n- Recursive proofs for scalability\n- SHARP (Shared Prover) architecture\n\n**Current Limitations:**\n- Centralized sequencer operated by StarkWare\n- Upgradeable contracts\n- Escape hatch exists but requires operator cooperation\n- Proof system covers execution but governance remains centralized\n\n#### 3.3.3 Scroll and Linea\n\nBoth represent newer zkEVM implementations:\n\n**Scroll:**\n- Type 2 zkEVM (EVM-equivalent)\n- Decentralized prover network in development\n- Currently centralized sequencing and proving\n\n**Linea:**\n- Developed by Consensys\n- Type 2 zkEVM\n- Centralized operations with roadmap toward decentralization\n\n### 3.4 Comparative Analysis\n\n```\nDecentralization Spectrum (January 2025)\n\nStage 2: [None]\n         |\nStage 1: [Arbitrum One]\n         |\nStage 0: [Base, OP Mainnet, zkSync Era, Starknet, Scroll, Linea, ...]\n         |\nCentralized: [Various app-specific rollups, new launches]\n```\n\nThe clustering at Stage 0 reflects both the technical difficulty of advancement and the recency of many implementations.\n\n---\n\n## 4. Critical Bottlenecks\n\n### 4.1 Proof System Maturity\n\n#### 4.1.1 Optimistic Rollup Challenges\n\nFraud proof systems face several fundamental challenges:\n\n**Complexity of Dispute Resolution:**\nThe fraud proof game requires proving that a specific instruction in a potentially billions-long execution trace was computed incorrectly. This involves:\n\n1. Interactive bisection to identify the disputed instruction\n2. One-step proof execution on L1\n3. Handling of edge cases (memory access, precompiles, etc.)\n\nArbitrum's BOLD protocol addresses the \"delay attack\" vulnerability where malicious actors could indefinitely postpone fraud proof resolution by posting multiple invalid claims. However, BOLD introduces its own complexity and capital requirements.\n\n**The Verifier's Dilemma:**\nRational validators may not monitor for fraud if the expected cost exceeds the expected reward. This creates scenarios where fraud could go unchallenged during periods of low attention or high gas prices.\n\n#### 4.1.2 ZK-Rollup Challenges\n\nZK-rollups face different but equally significant challenges:\n\n**Proof Generation Costs:**\nGenerating validity proofs remains computationally expensive:\n\n| Operation | Proving Time | Hardware Cost |\n|-----------|--------------|---------------|\n| Simple transfer | ~1 second | $0.001-0.01 |\n| Complex DeFi tx | ~10 seconds | $0.01-0.10 |\n| Full block proof | ~minutes | $1-10 |\n\nThese costs create centralization pressure, as only well-resourced operators can afford proving infrastructure.\n\n**Circuit Completeness:**\nZK circuits must correctly encode all EVM opcodes and edge cases. Bugs in circuit design can lead to:\n- Invalid state transitions being accepted\n- Valid transactions being rejected\n- Exploitable vulnerabilities\n\nThe zkEVM audit surface is enormous—millions of lines of code across compiler, prover, and verifier components.\n\n**Prover Centralization:**\nCurrently, all major ZK-rollups use centralized provers:\n\n```\nTransaction Flow (Current):\nUser → Centralized Sequencer → Centralized Prover → L1\n\nIdeal Flow:\nUser → Decentralized Sequencer Network → Decentralized Prover Market → L1\n```\n\n### 4.2 Sequencer Decentralization\n\nThe sequencer—the entity that orders transactions and produces blocks—represents the most significant centralization point in current rollups.\n\n#### 4.2.1 Current Centralization\n\nAll major rollups operate centralized sequencers:\n\n| Rollup | Sequencer Operator | Revenue Model |\n|--------|-------------------|---------------|\n| Arbitrum One | Offchain Labs | MEV + fees |\n| Base | Coinbase | Fees |\n| OP Mainnet | Optimism Foundation | Fees |\n| zkSync Era | Matter Labs | Fees |\n\nCentralized sequencers create risks:\n- **Censorship**: Operators can exclude transactions\n- **MEV extraction**: Operators capture ordering value\n- **Liveness**: Single point of failure\n- **Regulatory capture**: Operators subject to legal pressure\n\n#### 4.2.2 Decentralization Approaches\n\nSeveral approaches to sequencer decentralization are under development:\n\n**Leader Rotation:**\nValidators take turns as sequencer based on stake or random selection. Challenges include:\n- Latency increases from geographic distribution\n- MEV distribution complexity\n- Validator set management\n\n**Based Sequencing:**\nEthereum L1 validators sequence L2 transactions, inheriting L1's decentralization. Projects like Taiko are exploring this model. Trade-offs include:\n- Reduced L2 sovereignty\n- Increased L1 load\n- Cross-domain MEV complications\n\n**Shared Sequencing:**\nMultiple rollups share a decentralized sequencer network (e.g., Espresso, Astria). Benefits include:\n- Atomic cross-rollup transactions\n- Shared security\n- Economies of scale\n\nChallenges include:\n- Coordination complexity\n- Value distribution\n- Governance across ecosystems\n\n#### 4.2.3 Economic Considerations\n\nSequencer decentralization faces economic headwinds:\n\n```\nCurrent Model:\n- Sequencer captures 100% of MEV\n- Clear revenue stream funds development\n- Simple operational model\n\nDecentralized Model:\n- MEV distributed among validators\n- Development funding unclear\n- Complex coordination required\n```\n\nTeams must balance decentralization goals against sustainable economics.\n\n### 4.3 Upgrade Mechanisms and Governance\n\n#### 4.3.1 The Upgrade Dilemma\n\nRollups face a fundamental tension:\n\n- **Upgradeability enables bug fixes**: Critical vulnerabilities require rapid response\n- **Upgradeability enables attacks**: Malicious upgrades can steal funds\n\nCurrent approaches vary:\n\n| Rollup | Upgrade Mechanism | Timelock | Override |\n|--------|-------------------|----------|----------|\n| Arbitrum | Security Council | 12 hours | Yes |\n| Optimism | Guardian + Council | Variable | Yes |\n| zkSync Era | Matter Labs | 21 days | Yes |\n\nNone meet Stage 2 requirements (30+ day timelock, no override).\n\n#### 4.3.2 Security Council Structures\n\nSecurity Councils typically comprise 6-12 members requiring 4-9 signatures:\n\n**Arbitrum Security Council:**\n- 12 members from ecosystem organizations\n- 9/12 threshold for emergency actions\n- 7/12 for non-emergency upgrades\n- Members elected by ARB token holders\n\n**Optimism Security Council:**\n- 13 members\n- Nested multisig structure\n- Can pause fault proofs\n- Foundation maintains significant influence\n\nThe concentration of power in small groups contradicts decentralization principles but reflects practical necessity.\n\n#### 4.3.3 Path to Governance Minimization\n\nAchieving Stage 2 requires governance minimization:\n\n1. **Extended timelocks**: 30+ days allows users to exit before malicious upgrades\n2. **Constrained upgrades**: Limit what can be changed (e.g., no fund-stealing upgrades possible)\n3. **Immutability**: Eventually, core contracts become non-upgradeable\n\nThis path requires:\n- Mature, battle-tested code\n- Comprehensive formal verification\n- Community confidence in stability\n\n### 4.4 Data Availability Constraints\n\n#### 4.4.1 Current State\n\nEIP-4844 introduced blob transactions, providing ~125 KB/block of dedicated rollup data space. While a significant improvement, constraints remain:\n\n- **Blob limit**: ~6 blobs/block limits aggregate rollup throughput\n- **Blob fees**: Can spike during high demand\n- **Data retention**: Blobs pruned after ~18 days\n\n#### 4.4.2 Impact on Rollup Design\n\nData availability constraints force design trade-offs:\n\n**Calldata vs. Blobs:**\n```\nCalldata:\n- Permanent availability\n- Higher cost (~16 gas/byte)\n- Always available\n\nBlobs:\n- Temporary availability (~18 days)\n- Lower cost (~1 gas/byte equivalent)\n- Subject to market pricing\n```\n\n**State Diffs vs. Full Data:**\nZK-rollups can post only state differences rather than full transaction data, reducing costs but limiting:\n- Historical reconstruction\n- Independent verification\n- Forced transaction inclusion\n\n#### 4.4.3 Alternative DA Layers\n\nSome rollups use alternative data availability solutions:\n\n| Solution | Type | Security Model |\n|----------|------|----------------|\n| Celestia | Modular DA | Independent consensus |\n| EigenDA | AVS | Restaked ETH security |\n| Avail | Modular DA | Independent consensus |\n\nUsing alternative DA creates \"validiums\" rather than true rollups, introducing additional trust assumptions.\n\n---\n\n## 5. Emerging Solutions and Research Directions\n\n### 5.1 Proof System Advances\n\n#### 5.1.1 Proof Aggregation\n\nMultiple proofs can be aggregated into a single proof, reducing verification costs:\n\n```\nTraditional:\nRollup A proof → L1 verification ($X)\nRollup B proof → L1 verification ($X)\nTotal: $2X\n\nAggregated:\nRollup A + B proofs → Aggregator → Single proof → L1 verification ($X + ε)\nTotal: ~$X\n```\n\nProjects like Nebra and aligned layer are building proof aggregation infrastructure.\n\n#### 5.1.2 Hardware Acceleration\n\nSpecialized hardware dramatically reduces proving costs:\n\n| Approach | Speedup | Status |\n|----------|---------|--------|\n| GPU proving | 10-100x | Production |\n| FPGA | 100-1000x | Development |\n| ASIC | 1000x+ | Research |\n\nCompanies like Cysic, Ingonyama, and Ulvetanna are developing ZK-specific hardware.\n\n#### 5.1.3 New Proof Systems\n\nResearch continues on more efficient proof systems:\n\n- **Jolt**: RISC-V based proving with improved efficiency\n- **Binius**: Binary field arithmetic for faster proving\n- **Circle STARKs**: Improved STARK efficiency\n\n### 5.2 Decentralized Sequencing Progress\n\n#### 5.2.1 Arbitrum's Approach\n\nArbitrum is developing BoLD (Bounded Liquidity Delay) alongside sequencer decentralization:\n\n- Timeboost auction mechanism for transaction ordering\n- Planned validator set expansion\n- Economic incentives for honest behavior\n\n#### 5.2.2 Based Rollups\n\nTaiko's based rollup model delegates sequencing to L1:\n\n**Advantages:**\n- Inherits L1 decentralization immediately\n- No separate validator set required\n- Atomic L1-L2 composability\n\n**Challenges:**\n- Higher latency (~12 second blocks)\n- Limited L2 sovereignty\n- Complex MEV dynamics\n\n#### 5.2.3 Shared Sequencing Networks\n\nEspresso Systems and Astria are building shared sequencer infrastructure:\n\n```\nShared Sequencing Architecture:\n\n        ┌─────────────┐\n        │   Espresso  │\n        │  Sequencer  │\n        │   Network   │\n        └──────┬──────┘\n               │\n    ┌──────────┼──────────┐\n    │          │          │\n    ▼          ▼          ▼\n┌───────┐  ┌───────┐  ┌───────┐\n│Rollup │  │Rollup │  │Rollup │\n│   A   │  │   B   │  │   C   │\n└───────┘  └───────┘  └───────┘\n```\n\n### 5.3 Governance Innovation\n\n#### 5.3.1 Optimistic Governance\n\nSome proposals suggest \"optimistic\" upgrade mechanisms:\n\n1. Upgrade proposed\n2. Extended challenge period (30-90 days)\n3. If no valid challenge, upgrade executes\n4. Challenges evaluated by decentralized arbitration\n\n#### 5.3.2 Formal Verification Requirements\n\nRequiring formal verification for upgrades could enable shorter timelocks:\n\n- Mathematically proven correctness\n- Automated security analysis\n- Reduced reliance on human review\n\n#### 5.3.3 Exit-Focused Design\n\nPrioritizing exit guarantees over governance:\n\n- Ensure users can always exit, regardless of governance decisions\n- Limit upgrade scope to non-fund-affecting changes\n- Time-bound governance powers\n\n---\n\n## 6. Practical Implications\n\n### 6.1 For Users\n\n**Risk Assessment:**\nUsers should understand the trust assumptions of their chosen rollup:\n\n| Stage | Trust Assumptions | Risk Level |\n|-------|-------------------|------------|\n| 0 | Operator honesty, no malicious upgrades | Higher |\n| 1 | Security Council honesty, proof system soundness | Medium |\n| 2 | L1 security, cryptographic assumptions | Lower |\n\n**Practical Recommendations:**\n1. Monitor rollup stage classifications (L2Beat)\n2. Understand exit mechanisms and practice using them\n3. Diversify across rollups with different risk profiles\n4. Consider self-custody on L1 for large holdings\n\n### 6.2 For Developers\n\n**Building for Maturity:**\nDevelopers should design applications anticipating rollup maturation:\n\n1. **Avoid centralized dependencies**: Don't rely on sequencer-specific features\n2. **Implement fallbacks**: Design for potential L2 unavailability\n3. **Test exit paths**: Ensure users can withdraw via L1 mechanisms\n4. **Monitor upgrades**: Track rollup contract changes\n\n**Cross-Rollup Considerations:**\nAs the ecosystem fragments across rollups:\n- Implement bridging with appropriate security assumptions\n- Consider shared sequencing for atomic operations\n- Design for eventual interoperability standards\n\n### 6.3 For Rollup Teams\n\n**Prioritization Framework:**\nTeams should prioritize Stage advancement:\n\n1. **Immediate**: Deploy functional proof systems\n2. **Short-term**: Enable permissionless verification\n3. **Medium-term**: Implement robust escape hatches\n4. **Long-term**: Extend timelocks, decentralize sequencing\n\n**Communication:**\nTransparent communication about current limitations builds trust:\n- Publish security documentation\n- Disclose known risks\n- Provide upgrade roadmaps with timelines\n\n### 6.4 For Researchers\n\n**Open Problems:**\nSeveral research questions remain:\n\n1. **Optimal fraud proof economics**: How to incentivize monitoring without excessive costs?\n2. **Sequencer MEV**: How should MEV be distributed in decentralized sequencing?\n3. **Cross-rollup security**: How do security guarantees compose across rollups?\n4. **Governance attack resistance**: How to prevent governance capture?\n\n---\n\n## 7. Forward-Looking Analysis\n\n### 7.1 Timeline Projections\n\nBased on current development trajectories:\n\n**2025:**\n- Multiple rollups achieve Stage 1\n- First Stage 2 rollup possible (likely Arbitrum)\n- Shared sequencing networks launch\n- ZK-rollup proof systems mature\n\n**2026:**\n- Stage 2 becomes common for major rollups\n- Decentralized sequencing deployed in production\n- Hardware-accelerated proving widespread\n- Inter-rollup standards emerge\n\n**2027+:**\n- Full rollup maturity across ecosystem\n- Governance minimization achieved\n- Seamless cross-rollup experience\n- Rollups indistinguishable from L1 security perspective\n\n### 7.2 Potential Disruptions\n\nSeveral factors could accelerate or delay this timeline:\n\n**Accelerating Factors:**\n- Major security incident forcing rapid decentralization\n- Regulatory pressure on centralized operators\n- Breakthrough in proof system efficiency\n- Successful shared sequencing deployment\n\n**Delaying Factors:**\n- Discovery of fundamental proof system vulnerabilities\n- Economic unviability of decentralized operations\n- Fragmentation preventing coordination\n- User indifference to decentralization\n\n### 7.3 Long-Term Vision\n\nThe ultimate vision for rollups involves:\n\n1. **Full trustlessness**: Users trust only cryptography and L1 consensus\n2. **Seamless UX**: Cross-rollup transactions as easy as single-chain\n3. **Sustainable economics**: Decentralized operations remain profitable\n4. **Diverse ecosystem**: Specialized rollups for different use cases\n\n---\n\n## 8. Conclusion\n\nThe rollup ecosystem has made remarkable progress since the concept's introduction, evolving from theoretical proposals to production systems securing tens of billions of dollars. However, the journey toward full trustlessness remains incomplete. As of early 2025, only Arbitrum One has achieved Stage 1 status among major rollups, with Stage 2—true trustlessness—remaining unachieved.\n\nThe bottlenecks preventing advancement are multifaceted:\n\n1. **Proof system maturity**: Both fraud proofs and validity proofs require further development and battle-testing\n2. **Sequencer centralization**: All major rollups rely on centralized sequencers, creating censorship and liveness risks\n3. **Governance dependencies**: Security Councils with upgrade powers introduce trust assumptions\n4. **Economic sustainability**: Decentralized operations must remain economically viable\n\nEncouragingly, solutions are emerging across all dimensions. Fraud proof systems like BOLD address delay attacks, ZK hardware acceleration reduces proving costs, shared sequencing networks enable decentralization, and governance minimization frameworks provide paths to immutability.\n\nThe coming 18-36 months will likely see significant advancement. Multiple rollups should achieve Stage 1, with the first Stage 2 implementations possible by late 2025. However, achieving this vision requires sustained effort from rollup teams, researchers, and the broader community.\n\nFor users, developers, and stakeholders, understanding the current limitations and trajectory is essential. The rollup-centric future promises unprecedented scalability with L1-equivalent security—but that promise remains unfulfilled until Stage 2 becomes the norm rather than the exception.\n\n---\n\n## References\n\n1. Buterin, V. (2020). \"A rollup-centric ethereum roadmap.\" ethereum-magicians.org\n\n2. L2Beat. (2024). \"Rollup Stage Framework Documentation.\" l2beat.com/scaling/summary\n\n3. Offchain Labs. (2024). \"BOLD: Bounded Liquidity Delay Protocol.\" arbitrum.io/bold\n\n4. Optimism. (2024). \"Fault Proof System Specification.\" specs.optimism.io\n\n5. Matter Labs. (2024). \"zkSync Era Technical Documentation.\" docs.zksync.io\n\n6. StarkWare. (2024). \"Starknet Architecture.\" docs.starknet.io\n\n7. Espresso Systems. (2024). \"Shared Sequencing: Design and Implementation.\" espressosys.com\n\n8. Ethereum Foundation. (2024). \"EIP-4844: Shard Blob Transactions.\" eips.ethereum.org\n\n9. Taiko. (2024). \"Based Rollup Design.\" taiko.xyz/docs\n\n10. Thibault, L. et al. (2024). \"The Verifier's Dilemma in Optimistic Rollups.\" arxiv.org\n\n---\n\n*Report prepared January 2025. Data and stage classifications subject to change as rollups evolve. Readers should consult L2Beat and official rollup documentation for current status.*"
}